[{"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6962484", "label": "Nanchang West railway station", "description": "Nanchang West railway station: Nanchang West or Nanchangxi (Chinese: 南昌西站; pinyin: Nánchāngxī zhàn; lit. 'Nanchang west station') is a railway station on the Shanghai–Kunming and Hangzhou–Changsha high-speed lines located in Nanchang, Jiangxi, China. The foundation was laid in August 2010 and the station opened to service on 26 September 2013. The station building occupies an area of 114,500 square metres (1,232,000 sq ft). Nanchangxi is serviced by two side platforms and ten island platforms.\nNanchangxi is situated on Line 2 of the Nanchang Metro, which opened on 18 August 2017."}, {"id": "Q6202870", "label": "Jinxian South railway station", "description": "Jinxian South railway station: Jinxian South railway station is a railway station of Hangchangkun Passenger Railway located in Jinxian County, Nanchang, Jiangxi, People's Republic of China."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7878137", "label": "Uitikon Waldegg railway station", "description": "Uitikon Waldegg railway station: Uitikon Waldegg is a railway station in the village of Waldegg in the municipality of Uitikon in Switzerland. The station is on the Uetliberg line, which is operated by the Sihltal Zürich Uetliberg Bahn (SZU).The station is served by the following passenger trains:\nThe station is connected, by PostAuto bus route 201, with the villages of Uitikon and Ringlikon. The bus operates two or three times per hour on Monday to Saturday."}, {"id": "Q7334922", "label": "Ringlikon railway station", "description": "Ringlikon railway station: Ringlikon is a railway station situated near the village of Ringlikon in the municipality of Uitikon in Switzerland. The station is on the Uetliberg line, which is operated by the Sihltal Zürich Uetliberg Bahn (SZU).The station is served by the following passenger trains:\nThe station has a passing loop and two side platforms, and has no station buildings. Ringlikon village, which is some 700 m (2,300 ft) distant and 50 m (160 ft) lower, is linked to the station by a footpath."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q801388", "label": "Rotterdam Centraal railway station", "description": "Rotterdam Centraal railway station: Rotterdam Centraal station (Dutch pronunciation: [rɔtərˈdɑm sɛnˈtraːl], English: Rotterdam Central station) is the main railway station of the city Rotterdam in South Holland, Netherlands. The station received an average of 112,000 passengers daily in 2019. The current station building, located at Station Square, was officially opened in March 2014.\n\n"}, {"id": "Q801410", "label": "Schiphol Airport railway station", "description": "Schiphol Airport railway station: Schiphol Airport railway station is a major passenger railway station in Haarlemmermeer, Netherlands, beneath the terminal complex of Amsterdam Airport Schiphol, operated by the Nederlandse Spoorwegen. The station's six platforms are accessible via twelve escalators and three elevators located in the main concourse of the airport (Schiphol Plaza). The original station was opened in 1978, and the current station in 1995. It connects the airport to Amsterdam and other cities in the Netherlands, as well as to Belgium and France.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q17067477", "label": "Kailash Colony metro station", "description": "Kailash Colony metro station: Kailash Colony  is a Delhi Metro station in Delhi. It is located between Moolchand and Nehru Place stations on the Violet Line. The station was opened with the first section of the Line on 3 October 2010, in time for the Commonwealth Games opening ceremony on the same day."}, {"id": "Q6907367", "label": "Moolchand metro station", "description": "Moolchand metro station: Moolchand is a Delhi Metro station in Delhi. It is located between Lajpat Nagar and Kailash Colony stations on the Violet Line. The station was opened with the first section of the Line on 3 October 2010 in time for the Commonwealth Games opening ceremony on the same day. The station, being nearby to several schools like Kendriya Vidyalaya and Frank Anthony, is frequently used by school children who come from far away places."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q29026328", "label": "Kulem railway station", "description": "Kulem railway station: Kulem Railway Station (station code: QLM) is a main railway station in South Goa district, Goa. It serves Kulem village. The station consists of three platforms. The platforms are not well sheltered. It lacks many facilities including water and sanitation.Regular shuttle trains run between Vasco. It is the Passenger Train between Vasco and Kulem via Margao and Guntakal stops at Kulem to attach banker locomotives before the train starts journey up the Dudhsagar Falls to reach Castle Rock. The falls are a popular destination."}, {"id": "Q29026331", "label": "Sonalium railway station", "description": "Sonalium railway station: Sonalium Railway Station is a small railway station in South Goa district, Goa. Its code is LIM. It serves Sonalium village. The station consists of a single platform. The platform is not well sheltered. It lacks many facilities including water and sanitation. This station is one of three in Braganza Ghats."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2801243", "label": "Kontich-Lint railway station", "description": "Kontich-Lint railway station: Kontich-Lint is a railway station in the town of Kontich, Antwerp, Belgium. The station opened on 2 May 1836 on the 13, Lines 25 and 27. The train services are operated by National Railway Company of Belgium (NMBS)."}, {"id": "Q2070235", "label": "Duffel railway station", "description": "Duffel railway station: Duffel is a railway station in the town of Duffel, Antwerp, Belgium. The station opened on 16 June 1836 on the Lines 25 and 27. The train services are operated by National Railway Company of Belgium (NMBS)."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q22087871", "label": "Semantan MRT station", "description": "Semantan MRT station: The Semantan MRT Station is a mass rapid transit (MRT) station that serves the suburb of Damansara Heights, Kuala Lumpur, Malaysia. It is one of the stations on the MRT Kajang Line and was opened on 16 December 2016 when Phase One of the line became operational.The station is located near the Semantan Interchange (Jalan Dungun intersection) of the Sprint Expressway near Wisma UN, the United Nations (UN) representative office in Malaysia and the office area of Jalan Dungun."}, {"id": "Q22087870", "label": "Pusat Bandar Damansara MRT station", "description": "Pusat Bandar Damansara MRT station: The Pusat Bandar Damansara MRT Station, otherwise known as Pavilion Damansara Heights–Pusat Bandar Damansara MRT Station for sponsorship purposes, is a mass rapid transit (MRT) station serving the areas of Damansara Town Centre, Damansara Heights and Bangsar in Kuala Lumpur, Malaysia.\nIt is one of the stations of the Kajang Line and was opened on 16 December 2016 when Phase One of the line became operational."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5976522", "label": "Nanzih Export Processing Zone Station", "description": "Nanzih Export Processing Zone Station: Nanzih Export Processing Zone Station is a station on the Red line of Kaohsiung MRT in Nanzih District, Kaohsiung, Taiwan.\n\nThe station is a three-level, elevated station with one island platforms and six exits. It is 170 meters long and is located on Jiachang Houchang Rd. in front of the Nanzih Export Processing Zone."}, {"id": "Q5913054", "label": "Houjing Station", "description": "Houjing Station: Houjing is a station on the Red line of Kaohsiung MRT in Nanzih District, Kaohsiung, Taiwan.\n\nThe station is a three-level, elevated station with two Side platform and three exits. It is 153 meters long and is located near the intersection of Jiachang Rd. and Haijhuan Rd."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1211566", "label": "Shepherd's Bush tube station", "description": "Shepherd's Bush tube station: Shepherd's Bush is a London Underground station in the district of Shepherd's Bush in the London Borough of Hammersmith and Fulham. The station is on the Central line, between White City and Holland Park stations, and it lies in Travelcard Zone 2.\nThe station originally opened in 1900, but was closed for eight months in 2008 while the surface station building was replaced with a completely new structure and the underground station refurbished.\nA number of stations in the area both past and present have borne the name Shepherd's Bush; today the Central line station shares its name with the adjacent London Overground Shepherd's Bush station, with which it shares a surface-level interchange.\nAn entirely separate London Underground station, Shepherd's Bush Market on the Circle and Hammersmith & City lines is located approximately 1⁄3-mile (500 m) away. Until 2008, it too was called Shepherd's Bush until it was renamed to avoid confusion."}, {"id": "Q615430", "label": "Holland Park tube station", "description": "Holland Park tube station: Holland Park is a London Underground station, on Holland Park Avenue. It is served by the Central line, lying between Shepherd's Bush and Notting Hill Gate stations, in Travelcard Zone 2."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q3969452", "label": "Coleraine railway station", "description": "Coleraine railway station: Coleraine railway station serves the town of Coleraine in County Londonderry, Northern Ireland. It shares facilities with the town's Ulsterbus bus depot."}, {"id": "Q588868", "label": "Castlerock railway station", "description": "Castlerock railway station: Castlerock railway station serves the villages of Castlerock, Articlave and their surrounding hamlets in County Londonderry, Northern Ireland.  Walkers use the station to reach Mussenden Temple, Downhill Strand and Benone.\n\nThe station opened on 18 July 1853 and was built to a design by the architect Charles Lanyon. It comprised a single-storey red brick on the 'up' platform. There is a modern two storey addition to this in a similar style.As part of works to upgrade the Coleraine-Derry railway line, the passing loop at Castlerock station was discontinued and replaced with a new loop at Bellarena. The station signal box which was the last full-time mechanical signal box on the NIR network and the last to use block tokens was subsequently closed on 2 November 2016. The down platform, despite receiving a complete refurbishment two years prior, has now been taken out of service and the track lifted. All services calling at Castlerock now use the former up platform."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2093391", "label": "Tambabashi Station", "description": "Tambabashi Station: Tambabashi Station (丹波橋駅, Tanbabashi-eki) is a railway station located in Fushimi-ku, Kyoto, Kyoto Prefecture, Japan. It is connected by footbridge to nearby Kintetsu Tambabashi Station."}, {"id": "Q2093399", "label": "Fushimi-Momoyama Station", "description": "Fushimi-Momoyama Station: Fushimi-Momoyama Station (伏見桃山駅, Fushimi-Momoyama-eki) is a train station located in Fushimi-ku ward, city of Kyoto, Kyoto Prefecture, Japan."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7100930", "label": "Ordrup station", "description": "Ordrup station: Ordrup station is a commuter rail station serving the suburb of Ordrup north of Copenhagen, Denmark. \nIt is located on the Klampenborg radial of Copenhagen's S-train network and is served by the C-line, and in exceptional circumstances by the F-line to Hellerup."}, {"id": "Q5086228", "label": "Charlottenlund station", "description": "Charlottenlund station: Charlottenlund station is a commuter railway station serving the suburb of Charlottenlund north of Copenhagen, Denmark, as well as the nearby Charlottenlund Beach Park and the Charlottenlund Racetrack.Charlottenlund station is located on the Klampenborg radial of Copenhagen's S-train network and regularly served by trains on the C-line or F-line."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q8046737", "label": "Yagoona railway station", "description": "Yagoona railway station: Yagoona railway station is located on the Bankstown line, serving the Sydney suburb of Yagoona. It is served by Sydney Trains T3 Bankstown line services."}, {"id": "Q4856790", "label": "Bankstown railway station", "description": "Bankstown railway station: Bankstown railway station is located on the Bankstown line, serving the Sydney suburb of Bankstown. It is served by Sydney Trains T3 Bankstown line services."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2698494", "label": "Winchester railway station", "description": "Winchester railway station: Winchester railway station is a railway station in Winchester in the county of Hampshire, England. It is on the South West Main Line and was known as Winchester City from 1949–67 to distinguish it from Winchester (Chesil) station. It is 66 miles 39 chains (107.0 km) down the line from London Waterloo.\nDespite its prominence (most passenger trains stop here), the station only has two platforms. One is on the western side, with the line running in a northerly direction via Basingstoke, Woking, Surbiton,  Clapham Junction, towards the terminal at Waterloo. The other is on the eastern side, with the line running in a southerly direction, towards Eastleigh, where it splits and runs towards Southampton Central, Bournemouth and Weymouth or Portsmouth Harbour."}, {"id": "Q633826", "label": "Micheldever railway station", "description": "Micheldever railway station: Micheldever railway station, in the village of Micheldever Station, serves Micheldever (approximately 2 miles (3.2 km) to the south) and the surrounding area in Hampshire, England. It is a flint building with an added veranda. The station is on the South West Main Line, 58 miles 4 chains (93.4 km) down the line from London Waterloo towards Southampton and is managed by South Western Railway. The station is near the A303 Basingstoke to Andover road approximately 2.5 miles (4 km) from the village."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q9058930", "label": "Metro Peñón Viejo", "description": "Metro Peñón Viejo: Peñon Viejo is a station along Line A of the Mexico City Metro.  It is located in the Colonia Santa Martha Acatitla Norte and Colonia Santa Martha Acatitla Sur neighborhoods of the Iztapalapa borough of Mexico City.The logo is an Aztec-based glyph showing a rock that represents the Peñon Viejo formation near the station. The station was opened on 12 August 1991.From 23 April to 25 June 2020, the station was temporarily closed due to the COVID-19 pandemic in Mexico."}, {"id": "Q6824469", "label": "Metro Acatitla", "description": "Metro Acatitla: Acatitla is a station along Line A of the Mexico City Metro. It is an aboveground station. The station has connections to bus routes 162B, 163, 163A, 163B, 164, and 166. Service at this station began 12 August 1991."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7630300", "label": "Su'aoxin Station", "description": "Su'aoxin Station: Su-aoxin Station or Su-ao New (Chinese: 蘇澳新站; pinyin: Sū'ào Xīnzhàn) is a railway station on the Taiwan Railways Administration Yilan line located in Su'ao Township, Yilan County, Taiwan. It is an intersegmental station of Yilan line continued to Su'ao and the northern terminus of North-link line. The station was opened on 15 April 1968.\n\nThere are two island platforms and multiple tracks."}, {"id": "Q6137789", "label": "Su'ao Station", "description": "Su'ao Station: Su'ao (Chinese: 蘇澳車站; pinyin: Sūào Chēzhàn) is a railway station on the Taiwan Railways Administration Yilan line. It is located in Su'ao Township, Yilan County, Taiwan and is the southern terminus of the Yilan line.\nThe station was opened on 24 March 1919.\nThere is one side platform."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q13590986", "label": "Grateley railway station", "description": "Grateley railway station: Grateley railway station serves the village of Grateley, Hampshire, England, and the surrounding countryside. It is 72 miles 49 chains (116.9 km) down the line from London Waterloo. It is operated by South Western Railway.\nThe station opened on 1 May 1857. It was built 3⁄4 mile (1.2 km) southwest of Grateley village, near the hamlet of Palestine, after the local landowner objected to it being built any closer. Since then, a new settlement has grown up around the station.\nOn 5 June 1861, the Grateley station master was killed as a result of a driver and guard rushing to move freight wagons.The station has few facilities and is unmanned. There is a self-service ticket machine on platform 1 and smartcard readers on both platforms. There are two car parks for the large number of commuters who use the station. Displays on each platform show the next two trains.\nAll trains are operated by South Western Railway."}, {"id": "Q1976733", "label": "Salisbury railway station", "description": "Salisbury railway station: Salisbury railway station serves the cathedral city of Salisbury in Wiltshire, England. It is 83 miles 43 chains (134.4 km) from London Waterloo on the West of England line to Exeter St Davids. This is crossed by the Wessex Main Line from Bristol Temple Meads to Southampton Central. The station is operated and served by South Western Railway (SWR), and is also served by Great Western Railway (GWR)."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q104212231", "label": "Charoen Nakhon BTS station", "description": "Charoen Nakhon BTS station: Charoen Nakhon station (Thai: สถานีเจริญนคร) is a Gold Line station, located in Khlong San District, Bangkok, Thailand. The station is on Charoen Nakhon Road, next to Iconsiam complex and opened on 16 December 2020."}, {"id": "Q11299499", "label": "Krung Thon Buri BTS Station", "description": "Krung Thon Buri BTS Station: Krung Thon Buri station (Thai: สถานีกรุงธนบุรี, pronounced [sā.tʰǎː.nīː krūŋ tʰōn bū.rīː]}) is a BTS Skytrain station, on the Silom Line in Khlong San District, Bangkok, Thailand. The station is on Krung Thon Buri Road. It was the first station of Bangkok's rapid transit system on the Chao Phraya River's west bank.\nThe station opened on 15 May 2009, together with Wongwian Yai station on the 2.2 km (1.4 mi) Skytrain extension.\nKrung Thon Buri station connects to the Gold Line APM station of the same name.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q12516251", "label": "Citayam railway station", "description": "Citayam railway station: Citayam Station (CTA) is a railway station located in West Java, Indonesia; right on the border between Bojong Pondok Terong, Cipayung, Depok and Pabuaran, Bojong Gede, Bogor Regency. The station, which is located at an altitude of +120 m amsl, is owned by Operation Area I Jakarta of Kereta Api Indonesia (KAI). The north side of the station is a part of Depok, making it the southernmost station in the city, while the south side is a part Bogor Regency, making it the northernmost one in the regency. \nFrom this station there is a branch to Nambo Station which is 12.6 km long. The line was originally created to make a loopline from Parung Panjang Station to Sungai Lagoa Station id via Cikarang Station. However, due to the financial crisis and fall of President Soeharto in 1998, the line was idle.After two years, PT Kereta Api operates Manggarai–Nambo diesel multiple unit route. Unfortunately, due to outdated trains and low occupancy, the line was closed in 2006. Since 1 April 2015, the branch line to Nambo has started serving the KRL Commuterline. To the north of this station, before Depok Station, there used to be the Pondok Terong railway stop which is no longer active due to minimal occupancy and also due to the construction of the Jakarta–Bogor double track.\nSince 25 March 2021 this station along with Bekasi, Tanah Abang, Kranji, Jakarta Kota, Depok, Depok Baru, Bojong Gede, Parung Panjang, and Angke stations officially ceased the sale of single-trip cards for KRL Commuterline services."}, {"id": "Q4440968", "label": "Bojonggede railway station", "description": "Bojonggede railway station: Bojong Gede Station (BJD) is a railway station located in Bojong Gede, Bojong Gede, Bogor Regency, West Java that was opened in 1873. The station is located at an altitude of +140 meters above sea level. This station serves as a KRL Commuterline train stop serving the Jabodetabek area.\nOn 19 April 2022, the Ministry of Transportation carry out the physical work of the skybridge construction project after signing the work contract for the construction of the overpass that connects this station with the Bojong Gede type C bus terminal which is located 400 meters northwest of this station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7878210", "label": "Ujiyamada Station", "description": "Ujiyamada Station: Ujiyamada Station (宇治山田駅, Ujiyamada-eki) is a junction railway station located in the city of Ise, Mie Prefecture, Japan, operated by the private operator Kintetsu. It is the closest station to Ise Grand Shrine and thus has an important role for tourists and pilgrims. The station also administrates the section between Kushida Station and Isuzugawa Station."}, {"id": "Q6089533", "label": "Isuzugawa Station", "description": "Isuzugawa Station: Isuzugawa Station (五十鈴川駅, Isuzugawa-eki) is a passenger railway station in located in the city of Ise,  Mie Prefecture, Japan, operated by the private railway operator Kintetsu Railway."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1875185", "label": "Arsenalna", "description": "Arsenalna: Arsenalna (Ukrainian: Арсена́льна, romanized: Arsenál’na, IPA: [ɐrseˈnɑlʲnɐ],  ) is a station on the Kyiv Metro's Sviatoshynsko-Brovarska Line. The station was opened along with the first stage and is currently the second-deepest station in the world at 105.5 metres (346 ft), after Hongyancun station of the Chongqing Metro. The depth is attributed to the geography of Kyiv, whose high bank of the Dnipro River rises above the rest of the city. Also unusual is the station's design, which lacks a central concourse and thus is similar in layout to stations of the London Underground.\nSince 1986, the station has the status of \"Architectural Monument of Local Significance\", Protection Number 187.\n\n"}, {"id": "Q2684139", "label": "Dnipro", "description": "Dnipro: Dnipro is Ukraine's fourth-largest city, with about one million inhabitants. It is located in the eastern part of Ukraine, 391 km (243 mi) southeast of the Ukrainian capital Kyiv on the Dnipro River, after which its name is derived. Dnipro is the administrative centre of Dnipropetrovsk Oblast. It hosts the administration of Dnipro urban hromada. Dnipro has a population of 968,502 (2022 estimate).Archeological evidence suggests the site of the present city was settled by Cossack communities from at least 1524. Yekaterinoslav (\"glory of Catherine\") was established by decree of the Russian Empress Catherine the Great in 1787 as the administrative center of Novorossiya. From the end of the 19th century, the town attracted foreign capital and an international, multi-ethnic workforce exploiting Kryvbas iron ore and Donbas coal.\nRenamed Dnipropetrovsk in 1926 after the Ukrainian Communist Party leader Grigory Petrovsky, it became a focus for the Stalinist commitment to the rapid development of heavy industry. After World War II, this included nuclear, arms, and space industries whose strategic importance led to Dnipropetrovsk's designation as a closed city.\nFollowing the Euromaidan events of 2014, the city politically shifted away from pro-Russian parties and figures towards those favoring closer ties with the European Union. As a result of decommunization, the city was renamed Dnipro in 2016. Following the Russian invasion of Ukraine in February 2022, Dnipro rapidly developed as a logistical hub for humanitarian aid and a reception point for people fleeing the various battle fronts.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q800675", "label": "Dordrecht railway station", "description": "Dordrecht railway station: Dordrecht is a railway station in Dordrecht, Netherlands located on the Breda–Rotterdam railway and the Elst–Dordrecht railway. The station was opened on 1 January 1872, when the railway line between Rotterdam and Antwerp was opened.  On 16 July 1885, the railway line from Dordrecht to Gorinchem was opened. The neo-Renaissance railway station building is located to the south of the city centre. Dordrecht is now an important railway station on the Nederlandse Spoorwegen railway network. The services to Gorinchem and Geldermalsen are operated by Arriva.\n\n"}, {"id": "Q2231426", "label": "Dordrecht Stadspolders railway station", "description": "Dordrecht Stadspolders railway station: Dordrecht Stadspolders is a railway station in Dordrecht, Netherlands. The station is located on the MerwedeLingelijn between Dordrecht and Geldermalsen (part of the Elst–Dordrecht railway). It was opened on 27 May 1990 and initially had only one track.\nArriva has operated the service since December 2006, but Qbuzz took over services on 9 December 2018. The station is in the residential area Stadspolders. The station was expanded in 2011, with the building of a second track and platform, to allow 4 trains per hour in each direction. The connection between this station and the Dordrecht railway station has also two tracks."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7450929", "label": "Senriyama Station", "description": "Senriyama Station: Senriyama Station (千里山駅, Senriyama-eki) is a station on the Hankyu Senri Line in Suita, Osaka Prefecture, Japan, operated by the private railway operator Hankyu."}, {"id": "Q6361217", "label": "Kandai-mae Station", "description": "Kandai-mae Station: Kandai-mae Station (関大前駅, Kandai-mae-eki) is a train station on the Hankyu Railway Senri Line located in Suita, Osaka Prefecture, Japan."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q985903", "label": "Site of the First CPC National Congress·Xintiandi station", "description": "Site of the First CPC National Congress·Xintiandi station: Site of the First CPC National Congress · Xintiandi (Chinese: 一大会址·新天地; pinyin: Yīdà Huìzhǐ Xīntiāndì) is an interchange station between Shanghai Metro Lines 10 and 13, located in the Xintiandi shopping area of Huangpu District. Line 10 service commenced on 10 April 2010, while line 13 service commenced on 19 December 2015.\nOn 20 June 2021, to celebrate the 100th Anniversary of the Chinese Communist Party, the station name changed from Xintiandi Station to Site of the First CPC National Congress · Xintiandi Station."}, {"id": "Q985929", "label": "Madang Road station", "description": "Madang Road station: Madang Road (simplified Chinese: 马当路; traditional Chinese: 馬當路; pinyin: Mǎdāng Lù) became an interchange station between lines 9 and 13 of the Shanghai Metro on 19 December 2015.\nThe station opened on 31 December 2009, together with the other stations on Line 9's east extension.\nThe station was the temporary (between 20 April 2010 and 2 November 2010) terminus of Expo line/Line 13 during 2010 World Expo.\nThe station is located near the intersection of Madang Road and Xujiahui Road in Shanghai's Huangpu District."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q390655", "label": "Nezu Station", "description": "Nezu Station: Nezu Station (根津駅 Nezu-eki) is a metro station on the Tokyo Metro Chiyoda Line located in Bunkyo, Tokyo."}, {"id": "Q390662", "label": "Sendagi Station", "description": "Sendagi Station: Sendagi Station (千駄木駅, Sendagi-eki) is an underground railway station on the Tokyo Metro Chiyoda Line in Bunkyo, Tokyo, Japan, operated by Tokyo Metro."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q16893224", "label": "Kazipet railway station", "description": "Kazipet railway station: Kazipet Junction railway station (station code:- KZJ) is located in Hanamkonda district of Telangana. It is a crucial railway junction connecting Northern and Southern India."}, {"id": "Q18182693", "label": "Warangal railway station", "description": "Warangal railway station: Warangal Railway station (station code: WL) is located in Warangal city, Telangana state in southern India. The station and all trains are operated by Indian Railways' Secunderabad railway division, which is part of the South Central Railway Zone. The station is on the New Delhi–Chennai line that runs to Vijayawada, Allahabad and New Delhi. A neighboring railway station is Kazipet Junction. Warangal Station is part of the Visakhapatnam - Secunderabad Vande Bharat Express connecting Hyderabad to Visakhpatnam in 8 hours and 30 minutes"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2066965", "label": "Rugeley Trent Valley railway station", "description": "Rugeley Trent Valley railway station: Rugeley Trent Valley is a railway station located on the outskirts of Rugeley in Staffordshire, England. It is one of two stations serving Rugeley, the other being Rugeley Town. It is on the eastern side of the town close to the Rugeley Trent Valley Trading Estate and located close to the River Trent. West Midlands Trains operate the station, and all trains serving it.\nIt is a minor station on the Trent Valley section of the West Coast Main Line. It is also the terminus of the Chase Line from Birmingham and Walsall."}, {"id": "Q2649169", "label": "Rugeley Town railway station", "description": "Rugeley Town railway station: Rugeley Town railway station serves the market town of Rugeley, Staffordshire, England. The station is operated by West Midlands Railway, with services operated by West Midlands Railway and London Northwestern Railway. The station is situated around half a mile from Rugeley town centre. The station is located in Wharf Road."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7272113", "label": "Quincy Adams station", "description": "Quincy Adams station: Quincy Adams station is a rapid transit station in Quincy, Massachusetts. It serves the Braintree Branch of the MBTA's Red Line. Located in southern Quincy on Burgin Parkway near the Braintree Split, the station features a large park and ride garage, with space for 2,538 automobiles, built over the station tracks and platforms. It is fully accessible."}, {"id": "Q7875717", "label": "Quincy Center station", "description": "Quincy Center station: Quincy Center station is an intermodal transit station in Quincy, Massachusetts. It is a transfer station between the MBTA Red Line subway, MBTA Commuter Rail's Old Colony Lines and Greenbush Line, and a number of MBTA bus routes. It is located between Hancock Street and Burgin Parkway in the Quincy Center district. Opened in 1971, the station was covered by a large parking garage which was closed in 2012 due to structural problems and removed several years later. The station is accessible on all modes."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q11996138", "label": "Poul Henningsens Plads station", "description": "Poul Henningsens Plads station: Poul Henningsens Plads station is an underground Copenhagen Metro station located close to Poul Henningsens Plads in the Østerbro district of Copenhagen, Denmark. The station is on the City Circle Line (M3), between Trianglen and Vibenshus Runddel, and is in Zone 2. It is situated at the corner of Tåsingegade and Reersøgade with a main entrance that faces Jagtvej."}, {"id": "Q12007414", "label": "Trianglen station", "description": "Trianglen station: Trianglen station is an underground Copenhagen Metro station located at Trianglen (literally \"The Triangle\"), at the corner of Blegdamsvej and Øster Allé, in the Østerbro district of Copenhagen, Denmark. The station is on the City Circle Line  (M3), between Østerport and Poul Henningsens Plads, and is in Zone 1. The station is situated in front one of the entrances to Fælled Park and approximately  400 metres (1,300 ft) from the Parken Stadium."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6863025", "label": "Minami-machi 2-chome Station", "description": "Minami-machi 2-chome Station: Minami-machi 2-chome is a Hiroden station (tram stop) on Hiroden Hijiyama Line, located in Minami-ku, Hiroshima."}, {"id": "Q6863008", "label": "Minami-kuyakusho-mae Station", "description": "Minami-kuyakusho-mae Station: Minami-kuyakusho-mae is a Hiroden station (tram stop) on Hiroden Hijiyama Line, located in front of Hiroshima Minami Ward Office, in Hijiyama-honmachi, Minami-ku, Hiroshima."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q16902488", "label": "Vallathol Nagar railway station", "description": "Vallathol Nagar railway station: Vallathol Nagar railway station (station code: VTK) falls between Shoranur Junction and Mullurkara railway station in the Shoranur–Cochin Harbour section of Thrissur district. Vallathol Nagar railway station is operated by the Chennai-headquartered Southern Railways of the Indian Railways. It is the base station for Kerala Kalamandalam and last station in the Thiruvananthapuram railway division."}, {"id": "Q15260213", "label": "Mullurkara railway station", "description": "Mullurkara railway station: Mullurkara railway station (Station Code: MUC) falls between Vallathol Nagar railway station and Wadakkanchery railway station in the busy Shoranur–Cochin Harbour section in Thrissur district. Mullurkara railway station is operated by the Chennai-headquartered Southern Railways of the Indian Railways. All passenger trains stop here."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2424788", "label": "Thirsk railway station", "description": "Thirsk railway station: Thirsk railway station is on the East Coast Main Line and serves the market town of Thirsk, North Yorkshire, England. It is 210 miles 56 chains (339.1 km) down the line from London King's Cross and is situated between York to the south and Northallerton to the north. Its three-letter station code is THI.\nThe station is about 1.5 miles (2 km) outside of Thirsk town centre and is actually on the edge of the village of Carlton Miniott.\nThere are four tracks, but only the outer two have platforms; the platform faces serving the innermost pair of tracks were removed in the 1970s in preparation for higher-speed main line running using InterCity 125 trains. The station is operated by TransPennine Express. Other train services are provided by the open-access operator Grand Central."}, {"id": "Q2269429", "label": "York railway station", "description": "York railway station: York railway station is on the East Coast Main Line serving the cathedral city of York, North Yorkshire, England. It is 188 miles 40 chains (303.4 km) north of London King's Cross and on the main line it is situated between Doncaster to the south and Thirsk to the north. As of June 2018, the station is operated by London North Eastern Railway. It is the busiest station in North Yorkshire, the second busiest in Yorkshire & the Humber, and the fifth busiest in Northern England.York station is a key junction approximately halfway between London and Edinburgh. It is approximately five miles (eight kilometres) north of the point where the Cross Country and TransPennine Express routes via Leeds join the main line, connecting Scotland and the North East, North West, Midlands and southern England. The junction was historically a major site for rolling stock manufacture, maintenance and repair.\nIn Britain's 100 Best Railway Stations by Simon Jenkins, the station was one of only ten to be awarded five stars.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1843842", "label": "Great Missenden", "description": "Great Missenden: Great Missenden is an affluent village and civil parish in the Misbourne Valley in the Chiltern Hills in Buckinghamshire, England, situated between the towns of Amersham and Wendover. It adjoins the village of Little Kingshill, and is a mile from Little Missenden and the village of Prestwood. \nThe narrow and historic High Street is bypassed by the main A413 London to Aylesbury Road. It is located in the centre of the Chilterns Area of Outstanding Natural Beauty. The source of the Misbourne is to be found just north of the village, although the upper reach of the river runs only in winter and the perennial head is in Little Missenden. The village is now best known as home to the late Roald Dahl, the world-famous adult and children's author."}, {"id": "Q800384", "label": "Amersham station", "description": "Amersham station: Amersham is a London Underground station in Amersham in the Chiltern district of Buckinghamshire, England which is also used by National Rail services.\nAmersham station is a terminus of the London Underground's Metropolitan line. It is 23.7 miles (38.1 km) northwest of Charing Cross, making it the second furthest Underground station from central London and the second most westerly station of the whole London Underground system, after Chesham. It is in Travelcard Zone 9 (previously zone D).\nThe station has the highest elevation on the entire London Underground network at 147m above sea-level, higher than Big Ben tower.Amersham station is also served by Chiltern Railways, which runs trains between London Marylebone and Aylesbury. From Aylesbury a shuttle service to Princes Risborough provides access to through services between Marylebone and Birmingham Snow Hill. The journey times between Amersham and Central London range between 33 and 60 minutes. The journey time between Amersham and Chalfont & Latimer is about three and a half minutes."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5012859", "label": "CMBT", "description": "CMBT: Chennai Mofussil Bus Terminus, officially Puratchi Thalaivar Dr. M.G.R. Bus Terminus, is a bus terminus located in Chennai, India, providing inter-state bus transport services. It is located on the 100 feet (30 m) Jawaharlal Nehru Salai in Koyambedu between SAF Games Village and the Koyambedu Vegetable Market. It is the second largest bus terminus in India as well as Asia. Chennai Metro Rail has operated a coach depot behind the bus terminus since 2015."}, {"id": "Q6435138", "label": "Koyambedu metro station", "description": "Koyambedu metro station: Koyambedu is an important elevated metro station on the South-East Corridor of the Green Line of Chennai Metro in Chennai, India. This station will serve the neighbourhoods of Koyambedu, Koyambedu vegetable market, and Koyambedu Private Bus Terminus."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4748041", "label": "Ampang LRT station", "description": "Ampang LRT station: Ampang LRT station is a light rapid transit station operated by rapidKL serving the Ampang Line in Ampang, Selangor, Malaysia, just outside the eastern boundary of Kuala Lumpur. It is the eastern terminus for passenger services on the line. This station was opened in 1996, along with 17 other LRT stations."}, {"id": "Q5017395", "label": "Cahaya LRT station", "description": "Cahaya LRT station: Cahaya LRT station is a Malaysian low-rise rapid transit station situated near and named after the nearby Taman Cahaya (Malay; English: Cahaya Estate (Cahaya means light), in Ampang Jaya, Selangor. The station is part of the Ampang Line (formerly known as STAR, and the Ampang and Sri Petaling Lines), and was opened on December 16, 1996, as part of the first phase of the STAR system's opening, alongside 13 adjoining stations along the Sultan Ismail-Ampang route."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q25573814", "label": "Kumta railway station", "description": "Kumta railway station: Kumta railway station is a station on Konkan Railway. It is at a distance of 556.032 km (345.5 mi) down from origin. The preceding station on the line is Gokarna Road railway station and the next station is Honnavar railway station."}, {"id": "Q25573811", "label": "Gokarna Road railway station", "description": "Gokarna Road railway station: Gokarna Road railway station is a station on division of Konkan Railway in Gokarna, Karnataka. It is at a distance of 536.941 km (333.6 mi) down from origin. The preceding station on the line is Ankola railway station and the next station is Kumta railway station.The distance between Gokarna Road and Kumta railway stations of 19 km is the longest on the 741 km Konkan Railway line as on April, 2016. The Gokarna Road Railway station serves nearby Hindu (Sanatana) holy town Gokarna, Karnataka."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q24046577", "label": "Kommunarka", "description": "Kommunarka: Kommunarka is an urban-type settlement (posyolok) in Sosenskoye Settlement, Novomoskovsky Administrative Okrug, Moscow, Russia. The Kommunarka (Sokolnicheskaya line) station opened in 2019.\n\n"}, {"id": "Q27921408", "label": "Olkhovaya", "description": "Olkhovaya: Olkhovaya is a Moscow Metro station on the Sokolnicheskaya line. It was opened on 20 June 2019, as part of an extension that included Kommunarka, Prokshino, and Filatov Lug."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q367361", "label": "Trooperslane railway station", "description": "Trooperslane railway station: Trooperslane railway station serves the hamlet of Trooperslane in County Antrim, Northern Ireland.\nThere are plans to open a park and ride facility at the station.\nThe station was opened on 11 April 1848.For many years it was served only by peak-time services on Mondays to Saturdays.  On a trial basis in the 1990s, one service each way made a request stop on a Sunday, however this was not a success.\nWhen Northern Ireland Railways introduced a new clock-face timetable in the mid-2000s, the station once again saw a regular service seven days a week, with nearly all trains serving the station. Trooperslane also has a level crossing, supervised by closed-circuit television."}, {"id": "Q3969756", "label": "Greenisland railway station", "description": "Greenisland railway station: Greenisland railway station serves Greenisland in County Antrim, Northern Ireland. The station opened on 11 April 1848 as Carrickfergus Junction. It was renamed on 10 January 1893. The station used to be larger, with a third platform, but this was removed after the closure of the spur to the Derry~Londonderry Line. The station building is staffed from 7am to 3pm. A park and ride facility was built in 2009."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q12333500", "label": "Rimmen halt", "description": "Rimmen halt: Rimmen railway halt (Danish: Rimmen Trinbræt) is a railway halt, located a short distance north of the village of Nielstrup north of Frederikshavn in Vendsyssel, Denmark.The halt is located on the Skagensbanen railway line from Skagen to Frederikshavn between Jerup station and Strandby station. The train services are currently operated by Nordjyske Jernbaner which run frequent local train services between Skagen station and Frederikshavn station."}, {"id": "Q12319600", "label": "Jerup station", "description": "Jerup station: Jerup railway station is a railway station serving the village of Jerup in Vendsyssel, Denmark.The station is located on the Skagensbanen railway line from Skagen to Frederikshavn between Napstjært and Rimmen halts. The train services are currently operated by Nordjyske Jernbaner which run frequent local train services between Skagen station and Frederikshavn station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1811800", "label": "Rågsved metro station", "description": "Rågsved metro station: Rågsved metro station is on the Green line of the Stockholm metro, located in Rågsved, Söderort. The station was inaugurated on 13 November 1959 as the southern terminus of a one-station extension from Högdalen. On 1 December 1960 the line was extended further to Hagsätra. The distance to Slussen is 8.5 km (5.3 mi).\nA southerly extension of the Blue line of the Stockholm metro is currently under construction and expected to be opened for the passengers in 2030. As part of this development, the Blue line will take over this station."}, {"id": "Q1643503", "label": "Högdalen metro station", "description": "Högdalen metro station: Högdalen metro station is on the Green line of the Stockholm metro, located in Högdalen, Söderort, Stockholm Municipality. The station was inaugurated on 22 November 1954 as the south terminus of the extension from Stureby. On 13 November 1959, the line was extended south to Rågsved. The distance to Slussen is 7.3 km (4.5 mi). Högdalen metro station is connected to Högdalsdepån, a depot for subway trains.\nHögdalsdepån (Högdalen Depot) is a depot for cars of Stockholm metro, opened in 1957 and is connected to Högdalen metro station.\nA southerly extension of the Blue line of the Stockholm metro is currently under construction and expected to be opened for the passengers in 2030. As part of this development, the Blue line will take over this station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q801650", "label": "Yeovil Junction railway station", "description": "Yeovil Junction railway station: Yeovil Junction railway station is the busier, but less central, of two railway stations serving the town of Yeovil in England. The station is 2 miles (3.2 km) outside the town, in the village of Stoford. Although Yeovil is in Somerset, the station was in Dorset until 1991. It is 122 miles 48 chains (197.3 km) down the line from London Waterloo.\nIt was opened by the London and South Western Railway in 1860 on its London to Exeter line now known as the West of England Main Line. Today it is managed by South Western Railway and is also the home of the Yeovil Railway Centre."}, {"id": "Q2260029", "label": "Crewkerne railway station", "description": "Crewkerne railway station: Crewkerne railway station is located in Misterton in Somerset, England, and serves the area around the town of Crewkerne. It is 131 miles 33 chains (211.5 km) from London Waterloo on the West of England Main Line to Exeter. The main building is listed Grade II and is surrounded by several other old railway buildings."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q20718005", "label": "Majerhat railway station", "description": "Majerhat railway station: Majerhat railway station is a Kolkata Suburban Railway Station on the Budge Budge Branch line with an approximate 12 kilometres (7.5 mi) distance from the Sealdah railway station. It is under the jurisdiction of the Eastern Railway zone of Indian Railways. Majerhat railway station is one of the busiest railway stations in the Sealdah railway division. More than 45 pairs of EMU local trains pass through the railway station on a daily basis. It is situated in Kolkata in the Indian state of West Bengal. Majerhat railway station serves Majerhat and the surrounding areas."}, {"id": "Q57205979", "label": "Brace Bridge railway station", "description": "Brace Bridge railway station: Brace Bridge railway station is a Kolkata Suburban Railway station on the Budge Budge Branch line. It is under the jurisdiction of the Sealdah railway division in the Eastern Railway zone of the Indian Railways. It serves Parnasree Pally area in Kolkata in the Indian state of West Bengal."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2582397", "label": "Letchworth Garden City railway station", "description": "Letchworth Garden City railway station: Letchworth Garden City station serves the town of Letchworth in Hertfordshire, England.  The station is on the Cambridge Line 34 miles 50 chains (55.7 km) north of London King's Cross, and is a stop for services between King's Cross and Cambridge.  Trains which serve the station are operated by Great Northern."}, {"id": "Q2469591", "label": "Hitchin railway station", "description": "Hitchin railway station: Hitchin railway station serves the market town of Hitchin in Hertfordshire.  It is located approximately 1 mile (1.6 km) north east of the town centre and 31 miles 74 chains (51.4 km) north of London King's Cross on the East Coast Main Line.Until the current Stevenage station opened in 1973, many Intercity services stopped at Hitchin.\nIn August 2007 Hitchin was awarded Secure Station status after improvements to station security were made by First Capital Connect, including new lighting, extra CCTV and the installation of automatic ticket gates."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2371944", "label": "Towhid Metro Station", "description": "Towhid Metro Station: Towhid Metro Station is a station of Tehran Metro Line 4. It is located in Tohid Square on top of Tohid Tunnel. It is between Enghelab Metro Station and Shademan Metro Station (formerly known as Azadi Station). The station was opened on 7 February 2011. The station will also serve Line 7 when it opens."}, {"id": "Q5909873", "label": "Meydan-e Enghelab-e Eslami Metro Station", "description": "Meydan-e Enghelab-e Eslami Metro Station: Enghelab Metro Station is a station of Tehran Metro Line 4. It is located in Enghelab Square, the junctions of Azadi Street, Enqelab Street and Kargar Street. It is between Teatr-e Shahr Metro Station and Tohid Metro Station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2615632", "label": "Gravesend railway station", "description": "Gravesend railway station: Gravesend railway station serves the town of Gravesend in north Kent, England. It is 23 miles 75 chains (38.5 km) down the line from London Charing Cross.\nTrain services are operated by Southeastern and Thameslink. \nDuring Christmas 2013, a major overhaul of the lines and platforms changed the four track, two platform layout into two through lines and a western facing bay platform."}, {"id": "Q2545395", "label": "Northfleet railway station", "description": "Northfleet railway station: Northfleet railway station serves the town of Northfleet in the Borough of Gravesham in Kent, England. It is 21 miles 69 chains (35.2 km) down the line from London Charing Cross. Train services are operated by Southeastern and Thameslink.\nThe ticket office located on platform 2, on the 'down' side, is situated in the substantial station building. This is staffed between 06:00 - 10:00 Monday to Friday; at other times a ticket machine can be found outside the entrance, accepting card and contactless payments only.\nThere is no step-free access to platform 1 on the 'up' side. A foot tunnel connects the two platforms.\nThe station is very close to Ebbsfleet International station (the NNE entrance is only 334 yards (305 m) from Northfleet's station), but passengers (using public transport) will find it far easier to access Ebbsfleet International from Gravesend or Greenhithe, as these stations are more accessible and offer easy access to Fastrack bus services.  The walking route between the two stations is 0.6 miles (1 km) or 0.8 miles (1.3 km) and a suitable pedestrian link has not been built because of funding issues and objections from Land Securities."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6777218", "label": "Martinsburg station", "description": "Martinsburg station: Martinsburg station is a railway station in Martinsburg, West Virginia, United States, served by MARC Brunswick Line commuter rail service and Amtrak Capitol Limited intercity rail service. The station has one side platform serving a siding track of the CSX Cumberland Subdivision, with a footbridge crossing the siding and the two main tracks to provide access to the preserved Baltimore and Ohio Railroad Martinsburg Shops complex."}, {"id": "Q5312366", "label": "Duffields station", "description": "Duffields station: Duffields is a passenger rail station on MARC Train's Brunswick Line, in the community of Duffields, West Virginia. Since it is located in West Virginia, the station is maintained by the West Virginia State Rail Authority rather than by MARC itself. Between 1976 and 1981 this station was served by Amtrak's Shenandoah which traveled between Washington and Cincinnati.In 2015, a study began to look into the feasibility of replacing the station with a new station in nearby Ranson, West Virginia."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q25492281", "label": "Ra'anana South railway station", "description": "Ra'anana South railway station: Ra'anana South railway station is an Israel Railways passenger station at the boundary between Ra'anana, Kfar Saba and Kfar Malal. It serves the residents of the southern Sharon region. The station is located on the Sharon Railway, in the center of the large interchange connecting highways 4 and 531.\nThe addition of this station and its sister station Ra'anana West will reduce the travel time for Ra'anana and Kfar Saba residents to Tel-Aviv to approximately 11 minutes when the link via Herzliya railway station opens. The two stations were opened on 3 July 2018, and the link via Herzliya is scheduled to open in early 2020.\nWith only 233,114 passengers recorded in 2019, the station is the least used in the Central District."}, {"id": "Q20502866", "label": "Ra'anana West railway station", "description": "Ra'anana West railway station: Ra'anana West railway station is an Israel Railways passenger station in the median of Highway 531, between the cities of Ra'anana and Herzliya, as part of the Sharon Railway.\nThe addition of this station and its sister station Ra'anana South, is intended reduce travel time for Ra'anana residents to Tel-Aviv to approximately 11 minutes. The station was scheduled to open on 1 July 2018 but was delayed till 3 July."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2411555", "label": "La Varenne – Chennevières (Paris RER)", "description": "La Varenne – Chennevières (Paris RER): La Varenne–Chennevières station is a French railway station in Saint-Maur-des-Fossés, in Val-de-Marne, France."}, {"id": "Q2218079", "label": "Sucy – Bonneuil (Paris RER)", "description": "Sucy – Bonneuil (Paris RER): Sucy–Bonneuil station is a railway station on   network in Sucy-en-Brie, Val-de-Marne, France."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5845878", "label": "Bürglen railway station", "description": "Bürglen railway station: Bürglen railway station (German: Bahnhof Bürglen) is a railway station in  Bürglen, in the Swiss canton of Thurgau. It is an intermediate stop on the standard gauge Winterthur–Romanshorn line of Swiss Federal Railways."}, {"id": "Q801587", "label": "Weinfelden railway station", "description": "Weinfelden railway station: Weinfelden railway station is a railway station in the Swiss canton of Thurgau and the municipality of Weinfelden. The station is located on the Winterthur–Romanshorn railway line, at its junctions with the Mittelthurgau-Bahn lines to Wil and Konstanz.Weinfelden station is an intermediate stop on long-distance services from Brig to Romanshorn and Lucerne to Konstanz. It is also the terminus of Zürich S-Bahn services S24 and S30, together with services of the St. Gallen S-Bahn."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6131722", "label": "Sungai Buloh station", "description": "Sungai Buloh station: The Sungai Buloh station is an integrated railway station serving the suburb of Sungai Buloh in Selangor, Malaysia, which is located to the northwest of Kuala Lumpur.\nIt is an interchange station, with one section catering to the KTM Komuter Tanjung Malim-Port Klang Line and KTM ETS services, and another section for the MRT Putrajaya Line (formerly the MRT Kajang line). However, there is no paid-area integration between both sections as the two services use different ticketing systems. The newly built integrated station was opened on 16 December 2016 together with the opening of the first phase of the Kajang Line.The station was the northern terminus of the Kajang Line until October 2021. The MRT station was closed along with  PY03  Kampung Selamat  and  KG04  PY01  Kwasa Damansara until the opening of the Putrajaya line. Their transfer to the Putrajaya line was completed when it began partial operations on 16 June 2022."}, {"id": "Q6131705", "label": "Rawang railway station", "description": "Rawang railway station: The Rawang railway station is a railway station in Rawang, Gombak District, Selangor, Malaysia that is served by the KTM Komuter (of the Port Klang Line since 2015) and the KTM ETS train services.\nIt was the northernmost terminus for passenger services on the Rawang-Seremban Route since the start of the KTM Komuter service until 2015 when the trial route between Rawang and Port Klang began operating to cater to the KTM double track upgrading project. In 2016, the line Rawang-Port Klang Line was merged with the Rawang-Tanjung Malim shuttle service, thus ending Rawang's role as the northern terminus of the line.\nThe station built to cater the traffic around the suburb of Rawang as there were no other commuter or mass transit services in the Klang Valley that stopped here before the arrival of the KTM Komuter."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6868161", "label": "Minnesota Avenue Station", "description": "Minnesota Avenue Station: Minnesota Avenue station is an island-platformed Washington Metro station in the Central Northeast/Mahaning Heights  neighborhood of Northeast Washington, D.C., United States. The station was opened on November 20, 1978, and is operated by the Washington Metropolitan Area Transit Authority (WMATA).\nOn the Orange Line's westbound service, Minnesota Ave is the last station before crossing the Anacostia River, as well as the last above-ground station until East Falls Church in Virginia. West of the station, trains curve over RFK Stadium parking lots before descending underground."}, {"id": "Q7596515", "label": "Stadium–Armory Station", "description": "Stadium–Armory Station: Stadium–Armory station is a Washington Metro station in Southeast, Washington, D.C. It is located at the border of the Barney Circle and Kingman Park neighborhoods. The station was opened on July 1, 1977, and is operated by the Washington Metropolitan Area Transit Authority (WMATA). Stadium–Armory serves the Blue, Orange and Silver Lines. It is a transfer station, as this is the last station shared by the three lines before the lines diverge going east; east of the station, all three lines rise above ground onto elevated track to cross the Anacostia River. At the diverge point, the Orange Line continues above ground veering northbound towards the Minnesota Avenue station, and the Blue and Silver Lines continue eastbound entering a tunnel towards Benning Road."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6751521", "label": "Manquehue metro station", "description": "Manquehue metro station: Manquehue is an underground metro station on the Line 1 of the Santiago Metro, in Santiago, Chile. It is part of the 3.8 kilometres (2.4 mi) eastern extension of the Line 1. The station was opened on 7 January 2010 as part of the extension of the line from Escuela Militar to Los Dominicos,The station consists of a platform tunnel and three transepts containing a mezzanine each, which are connected by a bridge that is suspended from the tunnel ceiling by tie rods. Each mezzanine is accessed via two entrances on both sides of Apoquindo Avenue."}, {"id": "Q5249688", "label": "Escuela Militar metro station", "description": "Escuela Militar metro station: Escuela Militar is an underground metro station on the Line 1 of the Santiago Metro, in Santiago, Chile. It is located beneath the cloverleaf-like interchange of Apoquindo Avenue and Américo Vespucio Avenue. The station was opened on 22 August 1980 as part of the extension of the line from Salvador to Escuela Militar. It remained the eastern terminus of the Line 1 until 7 January 2010, when the line was extended to Los Dominicos, and is named for the nearby Escuela Militar del Libertador Bernardo O'Higgins."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2351064", "label": "Wimbledon Chase railway station", "description": "Wimbledon Chase railway station: Wimbledon Chase railway station is in the London Borough of Merton in South London. The station is served by Thameslink trains on the Sutton Loop Line. It is in Travelcard Zone 3 and is arranged as an island eight-car platform, with stairs descending to street level towards the southern end."}, {"id": "Q3951461", "label": "South Merton railway station", "description": "South Merton railway station: South Merton railway station is located in Morden, the administrative centre of the London Borough of Merton in South London. The station is served by Thameslink trains on the Sutton Loop Line. It is in Travelcard Zone 4."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5242114", "label": "Davos Platz railway station", "description": "Davos Platz railway station: Davos Platz railway station is a railway station in the municipality of Davos in the district of Prattigau/Davos in the Swiss canton of Graubünden.\nIt is the terminus of the Landquart–Davos Platz railway and the Davos Platz–Filisur railway. Northbound, there is a half-hourly service towards Landquart. Southbound, there is an hourly service to Filisur. The station also serves as a hub for local bus services. Davos Dorf station is located about 2.5 km northeast of Davos Platz.\nThe station currently has three platforms in use.\nThe lower station of the funicular Schatzalp-Bahn is located nearby."}, {"id": "Q5242109", "label": "Davos Dorf railway station", "description": "Davos Dorf railway station: Davos Dorf railway station (German: Bahnhof Davos Dorf) is a railway station in the municipality of Davos, in the Swiss canton of Grisons. It is an intermediate stop on the 1,000 mm (3 ft 3+3⁄8 in) metre gauge Landquart–Davos Platz line of the Rhaetian Railway.Northbound, there is a half-hourly service towards Landquart. Southbound, there is a half-hourly service to Davos Platz. The station also serves as a hub for local bus services. Davos Platz station is located about 2.5 km southwest of Davos Dorf.\nThe station currently has one platform in use, served by trains in both directions."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1865655", "label": "Pontlottyn railway station", "description": "Pontlottyn railway station: Pontlottyn railway station is a railway station serving the village of Pontlottyn, south Wales. It is a stop on the Rhymney Line of the Transport for Wales network."}, {"id": "Q2070775", "label": "Tir-Phil railway station", "description": "Tir-Phil railway station: Tir-Phil railway station is a railway station serving the village of Tir-Phil and the town of New Tredegar, south Wales. It is a stop on the Rhymney Line of the Valley Lines network. Work to extend the platform to take the proposed six car trains has now been completed."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q8069539", "label": "Zero Point railway station", "description": "Zero Point railway station: Marvi Railway Station (Urdu: ماروی ریلوے اسٹیشن, is the eastern terminus of the Hyderabad–Khokhrapar Branch Line. It is situated 8 km (5.0 mi) east of Khokhrapar, Sindh and lies on the Pakistan–India border. The station was constructed in February 2006 when Mirpur Khas–Munabao 1,000 mm (3 ft 3+3⁄8 in) railway was converted to the present day 1,676 mm (5 ft 6 in). The station is used for immigration and customs of passengers who travel on the Thar Express between Pakistan and India."}, {"id": "Q17075519", "label": "Munabao railway station", "description": "Munabao railway station: Munabao railway station is located in Barmer district in the Indian state of Rajasthan. It is a railway transit point on the India–Pakistan border.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1953807", "label": "Jægersborg station", "description": "Jægersborg station: Jægersborg station is a station on the Hillerød radial of the S-train network in Copenhagen, Denmark, served by the E and A-train.\nIt is also the southern terminus of the Nærumbanen local railway.\nThere are two distinct sets of platforms for each service. The S-train has double tracks and an island platform. Although there are two tracks with platforms on either side for the local Nærumbanen service, because it is the terminus of the single track line, only the closer southerly platform is regularly used."}, {"id": "Q578784", "label": "Lyngby station", "description": "Lyngby station: Lyngby station is a railway station serving the town and suburb of Kongens Lyngby in Greater Copenhagen, Denmark. It is situated centrally in Kongens Lyngby. With its large bus terminal, situated on the east side of the station, it is an important transport hub for public transport in the northern suburbs of Copenhagen.\nLyngby station is located on the Hillerød radial of Copenhagens S-train network.\nThe station opened in 1863. The current station building was built in 1957 and contains a shopping arcade with circa 15 stores, including two supermarkets."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2194900", "label": "Salford Central railway station", "description": "Salford Central railway station: Salford Central railway station is in the city of Salford, Greater Manchester, England, close to Spinningfields and Deansgate. It is served by trains to and from Manchester Victoria, towards Rochdale and Wigan Wallgate."}, {"id": "Q1859573", "label": "Manchester Victoria station", "description": "Manchester Victoria station: Manchester Victoria station in Manchester, England, is a combined mainline railway station and Metrolink tram stop. Situated to the north of the city centre on Hunts Bank, close to Manchester Cathedral, it adjoins Manchester Arena which was constructed on part of the former station site in the 1990s. Opened in 1844 and part of the Manchester station group, Victoria is Manchester's third busiest railway station after Piccadilly and Oxford Road and the second busiest station managed by Northern after Oxford Road.\nThe station hosts local and regional services to destinations in Northern England, such as Blackburn, Rochdale, Bradford, Leeds, Newcastle, Huddersfield, Halifax, Wigan, Southport, Blackpool (Sundays only) and Liverpool using the original Liverpool to Manchester line. Most trains calling at Victoria are operated by Northern. TransPennine Express services call at the station from Liverpool to Newcastle/Scarborough and services towards Manchester Airport (via the Ordsall Chord) from Middlesbrough/Redcar/Newcastle.\nManchester Victoria is a major interchange for the Metrolink light rail system. Two former railway lines into the station have been converted to tram operations: the line to Bury was converted in the early 1990s, in the first phase of Metrolink construction, and the line through Oldham to Rochdale was converted during 2009–2014. In the other direction, trams switch to on-street running when they emerge from Victoria Station and continue southwards through the city centre to Piccadilly or Deansgate-Castlefield.\nIn 2009, Victoria was voted the worst category B interchange station in the United Kingdom. The station underwent a two-year £44 million modernisation programme which was completed in August 2015. Renovation entailed electrification of lines through the station, renewed Metrolink stop with an additional platform, restoration of listed features, upgraded retail units, and a new roof. The Ordsall Chord directly linking Victoria to Oxford Road and Piccadilly was completed in December 2017.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5102035", "label": "Chiryū Station", "description": "Chiryū Station: Chiryū Station (知立駅, Chiryū-eki) is a railway station in the city of Chiryū, Aichi, Japan, operated by Meitetsu.\n\n"}, {"id": "Q6845742", "label": "Mikawa Chiryū Station", "description": "Mikawa Chiryū Station: Mikawa Chiryū Station (三河知立駅, Mikawa Chiryū-eki)  is a railway station in the city of Chiryū, Aichi, Japan, operated by Meitetsu."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4857460", "label": "Baohua Station", "description": "Baohua Station: Baohua station (Chinese: 宝华站; pinyin: Bǎohuá Zhàn) is a Metro station of Shenzhen Metro Line 5. It opened on 22 June 2011. This station is an underground station."}, {"id": "Q1012590", "label": "Bao'an Center Station", "description": "Bao'an Center Station: Bao'an Center station (simplified Chinese: 宝安中心站; traditional Chinese: 寶安中心站; pinyin: Bǎo'ān Zhōngxīn Zhàn; Jyutping: Bou2 On1 Zung1 Sam1 Zaam6), also spelled Bao'an Centre station, is an underground station on Line 1 and Line 5 of the Shenzhen Metro in Shenzhen, Guangdong Province, China. Line 1 platforms opened on 15 June 2011 and Line 5 platforms opened on 22 June 2011."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q3226814", "label": "Syon Lane railway station", "description": "Syon Lane railway station: Syon Lane railway station in Travelcard Zone 4 is on the Hounslow Loop Line and borders the Spring Grove and New Brentford neighbourhoods of the London Borough of Hounslow in west London. The office and light industrial zone to the north-east, the West Cross Centre, has among other businesses the headquarters and studios of broadcaster and entertainment multinational company Sky.  The station and all trains serving it are operated by South Western Railway."}, {"id": "Q2485750", "label": "Isleworth railway station", "description": "Isleworth railway station: Isleworth railway station is in the London Borough of Hounslow, in west London, and is in Travelcard Zone 4. It is 19 km (12 mi) west-southwest of London Waterloo. The unmanned station and all trains serving it are operated by South Western Railway."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q24912019", "label": "Şakirpaşa railway station", "description": "Şakirpaşa railway station: Şakirpaşa railway station (Turkish: Şakirpaşa istasyonu) is a railway station in Seyhan, Adana, on the Adana-Mersin railway. The station consists of two side platforms serving two tracks. There is no station building, only a small shelter on each platform. TCDD Taşımacılık operates frequent regional rail service from Mersin to Adana, along with further service to İskenderun and İslahiye. Together with regional trains, two intercity trains stop at Şakirpaşa as well; the Erciyes Express to Kayseri and the Taurus Express to Konya."}, {"id": "Q24912023", "label": "Şehitlik railway station", "description": "Şehitlik railway station: Şehitlik station is a railway station in Adana, located in the Yeşiloba mahalle of the Seyhan district. It is the closest railway station to the Central Coach Terminal at 1.5 km distance. Yeşiloba horse-racing venue is 1.6 km. west of the station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2736276", "label": "Brockley railway station", "description": "Brockley railway station: Brockley railway station serves the south-east London district of Brockley and is on the main railway line between London Bridge and Brighton. It is 3 miles 56 chains (3.70 miles, 5.95 km) down the line from London Bridge.\nThe station is operated by London Overground, with London Overground and Southern trains serving the station. Thameslink and some Southern services pass through the station. It is in Travelcard Zone 2."}, {"id": "Q648558", "label": "New Cross Gate railway station", "description": "New Cross Gate railway station: New Cross Gate is a railway station in New Cross, London, on the Brighton Main Line and the London Overground. It is 2 miles 70 chains (2.88 miles, 4.63 km) down the line from London Bridge and is about 600 m (660 yd) west of New Cross station. It is in Travelcard Zone 2, and is operated by London Overground."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4765820", "label": "Anjing railway station", "description": "Anjing railway station: The Anjing railway station (Chinese: 安靖站; pinyin: Ānjìng Zhàn) is a railway station on the Chengdu–Dujiangyan Intercity Railway and Chengdu West Ring Railway in Pidu District, Chengdu, Sichuan, China. This station has been fully built and some trains currently stop at Anjing. The oldname is Pixian Railway Station, the name change in 2010."}, {"id": "Q986895", "label": "Chengdu railway station", "description": "Chengdu railway station: Chengdu railway station (simplified Chinese: 成都火车站; traditional Chinese: 成都火車站; pinyin: Chéngdū Huǒchē Zhàn) is a major railway station in Chengdu, the capital of Sichuan province. The station is located on North Second Ring Road, Jinniu District, to the North of the city centre. It is operated by China Railway Chengdu Group and is one of the most important hubs of the railway network in China.\nChengdu railway station can be reached by taking Chengdu Metro Line 1 and Line 7 and the Chengdu BRT.\nFrom 11 October 2022, the station will be closed for refurbishment with passenger services diverted to other stations in Chengdu. It will be served by Chengdu–Chongqing Central line high-speed railway when the renovation completed."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6427323", "label": "Kolkata railway station", "description": "Kolkata railway station: Kolkata railway station (formerly known as Chitpur railway station) is the newest of the six intercity railway stations serving Howrah and Kolkata, West Bengal, India,  the others are Sealdah station in Kolkata and Howrah Junction, Dankuni Junction, Shalimar station and Santragachi Junction on western banks of the Hooghly river. Kolkata station is situated in the Chitpur locality of North Kolkata."}, {"id": "Q56277048", "label": "Patipukur railway station", "description": "Patipukur railway station: Patipukur railway station is a Kolkata Suburban Railway station in Patipukur. It serves the local areas of Patipukur in South Dumdum and Belgachia in the city of Kolkata, West Bengal, India. Only a few local trains halt here. The station has only a single platform. Its station code is PTKR."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4411886", "label": "Mäntsälä railway station", "description": "Mäntsälä railway station: Mäntsälä railway station (Finnish: Mäntsälän rautatieasema, Swedish: Mäntsälä järnvägsstation) is located in the town of Mäntsälä, Finland, approximately 60 kilometres (40 mi) from Helsinki Central railway station.\nThe station was opened on 3 September 2006 as part of the new Kerava-Lahti railway line, and is served by the Z-trains which run on this route."}, {"id": "Q4411676", "label": "Haarajoki railway station", "description": "Haarajoki railway station: Haarajoki railway station (Finnish: Haarajoen rautatieasema, Swedish: Haarajoki järnvägsstation) is located in the district of Haarajoki, in Järvenpää, Finland, 40.2 kilometres (25.0 mi) north of  Helsinki Central railway station.\nThe station was opened on 3 September 2006 as part of the new Kerava-Lahti railway line, and is served by the Z-trains which run on this route."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q11138910", "label": "Shenyang South railway station", "description": "Shenyang South railway station: Shenyang South railway station (simplified Chinese: 沈阳南站; traditional Chinese: 瀋陽南站; pinyin: Shěnyáng Nán Zhàn) is a railway station on the  Harbin–Dalian high-speed railway and Shenyang–Dandong intercity railway scheduled to open in 2015. It is in the Hunnan New Area district of Shenyang, Liaoning, China."}, {"id": "Q6130416", "label": "Shenyang railway station", "description": "Shenyang railway station: Shenyang railway station (simplified Chinese: 沈阳站; traditional Chinese: 瀋陽站; pinyin: Shěnyáng Zhàn) is a railway station on the Shenyang–Dalian railway, Shenyang–Dandong railway, Shenyang–Shanhaiguan railway, Huanggutun railway, Shenyang–Fushun intercity railway, Harbin–Dalian high-speed railway and Beijing–Shenyang high-speed railway. It is located in Heping District, Shenyang, Liaoning, China."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q8033064", "label": "Woodley railway station", "description": "Woodley railway station: Woodley railway station serves the suburb of Woodley in Stockport, Greater Manchester, England. The station is 9+1⁄4 miles (14.9 km) east of Manchester Piccadilly on a branch of the Hope Valley Line to Rose Hill Marple.  It is situated where the A560 road from Stockport to Gee Cross, near Hyde, crosses over the railway line."}, {"id": "Q2623426", "label": "Hyde Central railway station", "description": "Hyde Central railway station: Hyde Central railway station is the main station serving Hyde, Greater Manchester, England.\nOriginally simply Hyde, it was built by the Manchester, Sheffield and Lincolnshire Railway, opening in 1858 as a branch from its main line through Penistone to Sheffield. From 1862, the branch was extended to New Mills to meet the Midland Railway's extension of its line from Millers Dale. For a while, it saw Midlands expresses from London. In 1875, however, a new more direct route was built through Bredbury.\nThe substantial station buildings were demolished in 1980, with a new booking office at street level commissioned in their place.\nHyde is also served by Hyde North, on the same line as Hyde Central, and by Flowery Field, Newton for Hyde and Godley on the electrified Manchester to Glossop/Hadfield line."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q59915732", "label": "Garifa railway station", "description": "Garifa railway station: Garifa railway station is a railway station on Naihati – Bandel Branch line of Howrah railway division of Eastern Railway zone. It is situated at Hazi Nagar, Ramghat, Garifa in North 24 Parganas district in the Indian state of West Bengal. Garifa is a connecting station of Sealdah main line and Howrah–Bardhaman main line through Sampreeti Bridge and Jubilee Bridge. Number of Passenger and Naihati Bandel EMU locals stop at Garifa railway station."}, {"id": "Q15260806", "label": "Naihati Junction railway station", "description": "Naihati Junction railway station: Naihati Junction is a  Kolkata Suburban Railway  junction station on the Sealdah–Ranaghat line and Naihati–Bandel link. It is located in North 24 Parganas district in the Indian state of West Bengal.  It serves Naihati and the surrounding areas."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7269549", "label": "Quatama", "description": "Quatama: Quatama, formerly Quatama/Northwest 205th Avenue, is a light rail station in Hillsboro, Oregon, United States, that is served by TriMet as part of the MAX Light Rail system. Situated between Orenco station and Willow Creek/Southwest 185th Avenue Transit Center, it is the seventh eastbound station on the Blue Line. The two-track, island platform station includes a park-and-ride lot. Quatama Station is named after the area which includes Quatama Road to the south of the station. Opened in 1998, the stop is near high-tech industries and the Amberglen business park, which includes Oregon Health & Science University's West Campus and the Oregon National Primate Research Center. With the renaming of Northwest 205th Avenue to Northeast John Olsen Avenue by the city of Hillsboro in 2017, TriMet changed the station's name from its original, longer name."}, {"id": "Q7101572", "label": "Orenco / Northwest 231st Avenue", "description": "Orenco / Northwest 231st Avenue: Orenco is a light rail station in Hillsboro, Oregon, United States, served by TriMet as part of the MAX Light Rail system. It is the seventh station eastbound on the Blue Line, situated between the Quatama and Hawthorn Farm stations. The two-track, island platform station serves the Orenco Station neighborhood, which is considered a model for smart growth and transit-oriented development. It features a 125-space park and ride, a bike and ride, and connections to TriMet bus route 47–Baseline/Evergreen and Ride Connection's North Hillsboro Link.\nAn Oregon Electric Railway (OE) depot of the same name served the area in the early 20th century. The TriMet station was built as part of the Westside MAX project, which extended MAX from downtown Portland to downtown Hillsboro in 1998. In 2017, TriMet simplified the station's name from \"Orenco/Northwest 231st Avenue\" after the city renamed Northwest 231st Avenue to Northeast Century Boulevard."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q60169675", "label": "Majhdia railway station", "description": "Majhdia railway station: Majhdia railway station is a railway station on the Ranaghat–Gede line of the Kolkata Suburban Railway system and operated by Eastern Railway. It is situated beside Banpur–Majhdia Road at Majhdia, Krishnaganj of Nadia district in the Indian state of West Bengal. Number of EMUs stop at Majhdia railway station. The distance between Sealdah to this station is approximately 108 km."}, {"id": "Q60169676", "label": "Banpur railway station", "description": "Banpur railway station: Banpur railway station is a railway station on the Ranaghat–Gede line of the Kolkata Suburban Railway system and operated by Eastern Railway. It is situated beside Banpur–Majhdia Road at Banpur village of Nadia district in the Indian state of West Bengal. Number of EMUs stop at Banpur railway station. The distance between Sealdah to this station is approximately 111 km.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q3095803", "label": "Irun railway station", "description": "Irun railway station: Irun is a railway station in Irun, Basque Country, Spain. The station is located on the Bordeaux - Irun, Bilbao - Hendaye and Madrid–Hendaye railway lines. The station is served by TGV (high speed trains) operated by the SNCF and Alvia (High Speed Trains), Talgo, Arco, Estrella and Cercanías San Sebastián services operated by RENFE.\nThe station is a border railway station where all trains have to stop, as those coming from/going into France have to change gauge from 1,668 mm (5 ft 5+21⁄32 in) Iberian gauge to 1,435 mm (4 ft 8+1⁄2 in) standard gauge. The electric pickup supply also changes here from 3000 V DC (overhead Spain) to 1500 V DC (overhead France). Between the stations of Hendaye and Irun, both track gauges run together.\n\n"}, {"id": "Q2310209", "label": "Hendaye station", "description": "Hendaye station: Hendaye station (French: Gare d'Hendaye) is a railway station in Hendaye, France, on the Bordeaux-Irun and Madrid-Hendaye lines. The station is served by TGV high speed trains, Intercités de nuit night trains, Intercités long distance and TER local services operated by the SNCF, Trenhotel and Arco services operated by RENFE, and EuskoTren services.\nThe Euskotren 1,000 mm (3 ft 3+3⁄8 in) metre gauge services operate from a station on the forecourt of the SNCF station, for which separate ticketing is required.\nThe station is a border railway station where all trains have to stop, as those coming from/going into Spain have to change gauge from 1,435 mm (4 ft 8+1⁄2 in) standard gauge to 1,668 mm (5 ft 5+21⁄32 in) Iberian gauge. The electric supply also changes here from 1500 V DC (overhead France) to 3000 V DC (overhead Spain). Between the stations of Hendaye and Irun, both track gauges run together."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7430298", "label": "Scarborough Londesborough Road railway station", "description": "Scarborough Londesborough Road railway station: Scarborough Londesborough Road railway station, originally called Washbeck Excursion Station, was built as an excursion station to ease operating pressure at Scarborough Central in the holiday resort of Scarborough. It had a through and a bay platform. Excursion trains from all over the country could be routed into it rather than the main Central station to disembark their passengers before heading onwards to the Whitby branch line to be stabled in carriage sidings at Northstead/Gallows Close on the town's northern outskirts. Return services would follow the same route in the opposite direction to load up before departure.\nIt was opened on 8 June 1908 by the North Eastern Railway, but it was not advertised in public timetables until 1933, after it had been upgraded to a public station. It had one through platform which could handle a 14-carriage train, and a south-facing end platform which could handle 11-carriage trains. It was closed to passenger trains by British Railways on 25 August 1963, but remained in use for stabling coaching stock until its official closure on 4 July 1966.The station building and the remains of the 14 coach long platform can still be seen from trains on the Yorkshire Coast Line and on the York to Scarborough section of the North TransPennine route on the west side of the tracks approaching Scarborough. However, most of the platform has been demolished due to the construction of a new service depot for TransPennine Express trains."}, {"id": "Q2394227", "label": "Scarborough railway station", "description": "Scarborough railway station: Scarborough, formerly Scarborough Central, is a Grade II listed railway station serving the seaside town of Scarborough, North Yorkshire. It lies 42 miles (68 km) east of York and is one of the eastern termini on the North TransPennine route; it is managed by TransPennine Express. and is also served by Northern Trains. The station is also at the northern end of the Yorkshire Coast line and is reputed to have the longest station seat in the world at 456-foot (139 m).From 1907 until 2010, the station approaches were controlled from a 120-lever signal box named Falsgrave; this is sited at the outer end of platform 1 and close to the former excursion station at Scarborough Londesborough Road. In its final years, Falsgrave box controlled a mixture of colour-light and semaphore signals, including a gantry carrying 11 semaphores. The signal box was decommissioned in September 2010 and the gantry was dismantled and removed in October 2010. Its new home is at Grosmont railway station, on the North Yorkshire Moors Railway. The new signalling is a relay-based interlocking with two- and three-aspect LED signals controlled from an extension to the existing panel at nearby Seamer. Simplification of the track layout and major renewals took place at the same time."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5296023", "label": "Dongshankou station", "description": "Dongshankou station: Dongshankou Station (simplified Chinese: 东山口站; traditional Chinese: 東山口站; Jyutping: dung1 saan1 hau2 zaam6; Cantonese Yale: Dūngsāanháu Jaahm) is an underground station on Line 1 of the Guangzhou Metro that started operations on 28 June 1999. It is situated under Zhongshan Road (中山路), Nonglinxia Road (农林下路), Donghua Road South (东华南路), and Shuqian Road (署前路) in the Dongshankou area of Yuexiu District. The station takes its name from the former business district of Dongshan."}, {"id": "Q8048596", "label": "Yangji station", "description": "Yangji station: Yangji Station (simplified Chinese: 杨箕站; traditional Chinese: 楊箕站; Jyutping: joeng2 gei1 zaam6; Cantonese Yale: Yéunggēi Jaahm) is an interchange station on Line 1 and Line 5 of the Guangzhou Metro. It started operations on 28 June 1999 and is situated under Zhongshan 1st Road (中山一路) in Guangzhou's Yuexiu District, near Yangji Cun."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q10858541", "label": "Shapingba Station", "description": "Shapingba Station: Shapingba is a metro station of the Chongqing Rail Transit system in Shapingba District, Chongqing Municipality, China. The station began service on 28 July 2011 with the opening of Line 1 of Chongqing Rail Transit. Until the extension to Daxuecheng was completed and opened in 2012, it operated as the terminus of Line 1. It later was expanded to accommodate two extra metro lines to the south of the Line 1 metro station, to serve the Loop Line (opened on December 28, 2018) and Line 9 (opened on January 25, 2022), but the transfer passage didn't open until 30 September 2022. Line 27, which is currently under construction, will also serve the station in future.\nIt also interchanges with the renovated Shapingba railway station, as an Integrated Transport Hub, with connected bus and taxi modes."}, {"id": "Q10858543", "label": "Xiaolongkan Station", "description": "Xiaolongkan Station: Xiaolongkan is a station on Line 1 and  Line 9 of Chongqing Rail Transit in Shapingba District, Chongqing Municipality, China. It opened in 2011.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q24807831", "label": "Sawantwadi Road railway station", "description": "Sawantwadi Road railway station: Sawantwadi Road railway station is a train station on the Konkan Railway. It is at a distance of 363.880 km (226.1 mi) down from origin. The preceding station on the line is Zarap railway station and the next station is Madure railway station."}, {"id": "Q24944726", "label": "Zarap railway station", "description": "Zarap railway station: Zarap railway station is a train station on the Konkan Railway. It is at a distance of 353.300 km (219.5 mi) down from origin. The preceding station on the line is Kudal railway station and the next station is Sawantwadi Road railway station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q19580817", "label": "ITO metro station", "description": "ITO metro station: The Dabur ITO metro station is a station on the Delhi Metro, under the Violet Line. It was inaugurated on 8 June 2015 by the then Urban Development Minister M Venkaiah Naidu and Delhi Chief Minister Arvind Kejriwal.\nThe ITO metro station was one of the most awaited stations of the Delhi Metro under Phase III expansion. Whereas the opening of the Mandi House metro station, which is also an interchange station now, took a chunk of the load off the Rajiv Chowk metro station. The ITO metro station is expected to take some of the surface traffic off the ITO intersection, which witnesses heavy traffic jams due to a number of private and commercial vehicles, coming from South and East Delhi, which is the main arterial road for the people residing in those areas. According to Delhi Police, the ITO intersection is one of the most congested areas in the city, with the entire flow of traffic from east Delhi to the rest of the city and vice versa. going through this intersection. Over 1.75 lakh vehicles use the ITO intersection every day.\nWith the opening of the ITO metro station, a number of commuters whose offices are located in the ITO area as expected to switch to the metro. As per estimates of the Delhi Metro, around 25,000 commuters are expected to use the station by 2016. The number will go up to over 35,000 by 2021, said a Delhi Metro official."}, {"id": "Q6748047", "label": "Mandi House metro station", "description": "Mandi House metro station: The Mandi House metro station is located on the Blue Line and Violet Line of the Delhi Metro in Delhi, India. It services the cultural hub of Delhi, the Mandi House area which has the National School of Drama, Ravindra Bhavan, home of Sangeet Natak Akademi and Sahitya Akademi, Shri Ram Centre for Performing Arts and Triveni Kala Sangam, As well as the Bengali Market and the nearby residential areas."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q490545", "label": "Dongdaemun Station", "description": "Dongdaemun Station: Dongdaemun (Korean: 동대문; Hanja: 東大門; lit. East Great Gate) station is a station on Line 1 and Line 4 of the Seoul Metropolitan Subway. Sometimes called Dong Station, it is named after one of the Four Great Gates of the circular wall surrounding ancient Seoul, and is situated on the eastern end of Jongno (\"Bell Street\"). This station is also close to Dongdaemun Market.In December 2010 the station is recorded as having the third highest WiFi data consumption of all the Seoul Metropolitan Subway stations, following Express Bus Terminal station, Sadang station, and followed by Jamsil station and Jongno 3(sam)-ga station."}, {"id": "Q497926", "label": "Hyehwa Station", "description": "Hyehwa Station: Hyehwa Station (Korean: 혜화역) is a station on the Seoul Subway Line 4 in Jongno-gu, Seoul. It is located in the center of the area commonly known as Daehangno, and much of the ridership of this station comes from the nightlife scene. The Seoul National University Yongon campus, housing its Hospital and School of Medicine, is located to the southwest.\nThe station was the center of the 2018-2019 Hyehwa Station protest to rally against discrimination of women and spy camera crimes."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1912686", "label": "Loughborough railway station", "description": "Loughborough railway station: Loughborough is a Grade II listed railway station in the town of Loughborough, Leicestershire; it is on the Midland Main Line and is located 111 miles (179 km) north of London St Pancras. The station is sited to the north-east of the town centre."}, {"id": "Q5328988", "label": "East Midlands Parkway railway station", "description": "East Midlands Parkway railway station: East Midlands Parkway railway station is located north of Ratcliffe-on-Soar on the Midland Main Line in the East Midlands of England. It provides park and ride facilities for rail passengers on the routes from Leicester to Derby and Nottingham. It is also the closest station to East Midlands Airport, some 4 miles (6.4 km) away, but without public transport link.\nThe station lies in south-west Nottinghamshire, close to the boundaries with Leicestershire and Derbyshire, between the stations at Loughborough, Long Eaton and Attenborough. When it opened, there was a little-used shuttle bus from the station to the airport, but this ceased not long afterwards. An hourly minibus service was re-introduced in 2015 but later withdrawn. The main station building and the 850-vehicle car park are to the west of the line, opposite Ratcliffe-on-Soar Power Station. Road access is via the A453, which provides a link to the nearby M1 motorway."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7975407", "label": "Waverley station", "description": "Waverley station: Edinburgh Waverley railway station (also known simply as Waverley; Scottish Gaelic: Waverley Dhùn Èideann) is the principal railway station serving Edinburgh, Scotland. It is the second busiest station in Scotland, after Glasgow Central. The station serves as the northern terminus of the East Coast Main Line, 393 miles 13 chains (393.16 miles; 632.7 kilometres) from London King's Cross, although some trains operated by London North Eastern Railway continue to other Scottish destinations beyond Edinburgh.\n\n"}, {"id": "Q7966591", "label": "Waltham station", "description": "Waltham station: Waltham station is an MBTA Commuter Rail station in Waltham, Massachusetts, served by the Fitchburg Line. It is located in downtown Waltham adjacent to Central Square (Waltham Common). The station is the transit hub of Waltham, with MBTA bus routes 61, 70, 553, 554, 556, and 558 stopping on Carter Street adjacent to the station.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5242109", "label": "Davos Dorf railway station", "description": "Davos Dorf railway station: Davos Dorf railway station (German: Bahnhof Davos Dorf) is a railway station in the municipality of Davos, in the Swiss canton of Grisons. It is an intermediate stop on the 1,000 mm (3 ft 3+3⁄8 in) metre gauge Landquart–Davos Platz line of the Rhaetian Railway.Northbound, there is a half-hourly service towards Landquart. Southbound, there is a half-hourly service to Davos Platz. The station also serves as a hub for local bus services. Davos Platz station is located about 2.5 km southwest of Davos Dorf.\nThe station currently has one platform in use, served by trains in both directions."}, {"id": "Q5242114", "label": "Davos Platz railway station", "description": "Davos Platz railway station: Davos Platz railway station is a railway station in the municipality of Davos in the district of Prattigau/Davos in the Swiss canton of Graubünden.\nIt is the terminus of the Landquart–Davos Platz railway and the Davos Platz–Filisur railway. Northbound, there is a half-hourly service towards Landquart. Southbound, there is an hourly service to Filisur. The station also serves as a hub for local bus services. Davos Dorf station is located about 2.5 km northeast of Davos Platz.\nThe station currently has three platforms in use.\nThe lower station of the funicular Schatzalp-Bahn is located nearby."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q801389", "label": "Ryōgoku Station", "description": "Ryōgoku Station: Ryōgoku Station (両国駅, Ryōgoku-eki) is a railway station in Yokoami, Sumida, Tokyo, Japan, operated by East Japan Railway Company (JR East) and Tokyo Metropolitan Bureau of Transportation (Toei)."}, {"id": "Q801017", "label": "Kinshichō Station", "description": "Kinshichō Station: Kinshichō Station (錦糸町駅, Kinshichō-eki) is a railway station in Sumida, Tokyo, Japan, operated by East Japan Railway Company (JR East) and Tokyo Metro. The surrounding area is the largest shopping district in Sumida Ward, featuring several large department stores, numerous small shops and restaurants."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7964100", "label": "Waltensburg/Vuorz railway station", "description": "Waltensburg/Vuorz railway station: Waltensburg/Vuorz railway station is a station on the Reichenau-Tamins–Disentis/Mustér railway of the Rhaetian Railway in the Swiss canton of Graubünden. It serves the village of Waltensburg/Vuorz in the municipality of Breil/Brigels."}, {"id": "Q7377865", "label": "Rueun railway station", "description": "Rueun railway station: Rueun railway station is a station on the Reichenau-Tamins–Disentis/Mustér railway of the Rhaetian Railway in the Swiss canton of Graubünden. It serves the village of Rueun, in the municipality of Ilanz/Glion."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2346420", "label": "Shirehampton railway station", "description": "Shirehampton railway station: Shirehampton railway station is on the Severn Beach Line and serves the district of Shirehampton in Bristol, England. It is 7.6 miles (12.2 km) from Bristol Temple Meads. Its three letter station code is SHH. The station has a single platform which serves trains in both directions. As of 2015 it is managed by Great Western Railway, which is the third franchise to be responsible for the station since privatisation in 1997. They provide all train services at the station, mainly a train every 30 minutes in each direction.\n\nThe station was opened in 1865 as the headquarters of the Bristol Port Railway and Pier, a railway which ran along the River Avon from Hotwells to a pier at Avonmouth, and was linked to the national network in 1877. The station had a single platform to begin with, but was rebuilt with a second in 1903, as well as a signal box and a goods yard. By the 1930s the station had ten staff.\nThe Severn Beach Line declined over the latter half of the twentieth century, with passenger numbers falling significantly. Goods services at Shirehampton ended in 1965, and all staff were withdrawn in 1967. The second platform and signal box were taken out of use in 1970, with the station buildings sold off and later destroyed by fire. Services had decreased to ten per day each direction by 2005, but have since increased to a train every 30 minutes in each direction."}, {"id": "Q2198007", "label": "Avonmouth railway station", "description": "Avonmouth railway station: Avonmouth railway station is located on the Severn Beach Line and serves the district of Avonmouth in Bristol, England. It is 9.0 miles (14.5 km) from Bristol Temple Meads. Its three letter station code is AVN. The station has two platforms, on either side of two running lines. As of 2015 it is managed by Great Western Railway, which is the third franchise to be responsible for the station since privatisation in 1997. They provide all train services at the station, mainly a train every 30 minutes to Bristol Temple Meads and one every hour to Severn Beach.\n\nThe station was opened in 1877 by the Bristol Port Railway and Pier, a railway which ran along the River Avon from Hotwells to a pier at Avonmouth. The station, originally known as Avonmouth Dock, had a single platform, but was rebuilt with two platforms by the Great Western and Midland Railways in 1885 when they began services via Clifton Down. The station was enhanced numerous times in the early part of the twentieth century, and by 1913 employed 72 staff. Facilities included a goods yard, signal box and engine shed.\nThe Severn Beach Line declined over the latter half of the twentieth century, with passenger numbers falling significantly. Goods services at Avonmouth ended in 1966, and all staff were withdrawn in 1967. Services had decreased to 10 per day each direction by 2005, but have since increased to a train every 30 minutes to Bristol and hourly to Severn Beach."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2911648", "label": "Botanic railway station", "description": "Botanic railway station: Botanic railway station serves the Botanic area in south Belfast, Northern Ireland and students for Queen's University Belfast; it is also near Shaftesbury Square which is along Botanic Avenue. It is named after the nearby Belfast Botanic Gardens. It is one of the four stations located in the city centre, the others being City Hospital, Great Victoria Street, and Lanyon Place.\nThe station opened on 26 April 1976 and is very close to City Hospital StationPassengers can alight here for the Ulster Museum, which is situated on the edge of Botanic Gardens."}, {"id": "Q3969429", "label": "City Hospital railway station", "description": "City Hospital railway station: City Hospital railway station, situated on Donegall Road, serves Belfast City Hospital and the surrounding area of south Belfast, Northern Ireland. It is one of the four stations located in the city centre, the others being Great Victoria Street, Botanic, and Lanyon Place.\nThe station opened on 6 October 1986, and is very close to Botanic Station"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q674350", "label": "Kőbánya-Kispest", "description": "Kőbánya-Kispest: Kőbánya-Kispest is the southern terminus of the M3 Line (North-South line) of the Budapest Metro. It is the only station of the line that is above ground. The station was opened on 20 April 1980 as part of the extension from Nagyvárad tér.The metro station is named after the train station next to the terminal, which lies on the border of the districts Kőbánya and Kispest. It is also a suburban bus terminal and a changing place of several city bus lines (68, 85, 85E, 93, 93A, 98, 98E, 136E, 148, 151, 182, 184, 193E, 200E - this run from here to Budapest Ferenc Liszt International Airport, 201E, 202E, 282E, 284E), making it the largest public transport hub in Southern-Pest. Hungarian people sometimes call this station Köki, which is short for Kőbánya-Kispest. Next to the station, there is a huge housing estate with concrete block of flats (Kispest microdistrict) and a shopping mall, named Köki Terminál. A bust of Ferenc Puskás is placed next to the shopping mall."}, {"id": "Q2635030", "label": "Határ út", "description": "Határ út: Határ út is a station on the M3 (North-South) line of the Budapest Metro. Near the station, there are several tram and bus terminus, and a shopping centre. Határ út station named after the adjacent street Határ út, which literally means \"(City) Border Street\". Before the formation of Greater Budapest it was the border of Budapest Capital. The station was opened on 20 April 1980 as part of the extension from Nagyvárad tér to Kőbánya-Kispest."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6808839", "label": "Megaro Moussikis metro station", "description": "Megaro Moussikis metro station: Megaro Mousikis (Greek: Μέγαρο Μουσικής, lit. 'Concert Hall'), also known as Megaro Moussikis on signage, is a station on the Athens Metro, located just outside the Athens Concert Hall on Vassilissis Sophias Ave. The U.S. Embassy, as well as the hospitals \"Alexandra\", \"Areteion\", \"NIMITS\" and \"Eginition\", are close to the station."}, {"id": "Q5415827", "label": "Evangelismos metro station", "description": "Evangelismos metro station: Evangelismos (Greek: Ευαγγελισμός, lit. 'Annunciation') is a metro station located on Vasilissis Sofias Avenue. It is in Evangelismos area, close to Evangelismos Hospital, the National Gallery of Athens, the Athens War Museum, the Byzantine & Christian Museum and the Athens Hilton. The station serves both Kolonaki and Pangrati neighbourhoods, known for their cultural hubs, shopping centers and cafes. Furthermore, many embassies and companies are located within close proximity.\nThis station was inaugurated in 2000 as part of the original Athens Metro section."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q17025373", "label": "Jiangmen Railway Station", "description": "Jiangmen Railway Station: Jiangmen East railway station (Chinese: 江门东站), formerly Jiangmen railway station (Chinese: 江门站), is an elevated station on the Guangzhou–Zhuhai intercity railway Jiangmen Spur Line.The station is located at the junction of Wuyi Road (Chinese: 五邑路) and Donghai Road (Chinese: 東海路) in the Jianghai District of Jiangmen City, Guangdong Province, China, near the Jiangmen National-Level High-Tech Industry Development Zone and the Jianghai District Government and Jianghai First Secondary School. It started operations on 7 January 2011. Jiangmen station was renamed Jiangmen East station in English and Chinese on 10 March 2017. A former freight-only station was renamed Jiangmen railway station and opened to passenger services on 15 November 2020."}, {"id": "Q8044600", "label": "Xinhui railway station", "description": "Xinhui railway station: Xinhui railway station (Chinese: 新会站) is an elevated station of Guangzhou–Zhuhai intercity railway Jiangmen Spur Line. It started operation on 7 January 2011.\nThe station is located near Dongjia Village (Chinese: 東甲村) in Huicheng Street (Chinese: 会城街道), Xinhui District, Jiangmen, Guangdong, China. Since it is far away from the current bus terminus in Huicheng, a new bus terminus will be built to serve the passengers. The station started operations in 2011.Xinhui Station was formerly called Jiangmen West Station (Chinese: 江门西站) when planning. However, the station name was strongly criticized by Xinhui citizens that it degraded the position of Xinhui. Therefore, the authorities finally renamed the station to Xinhui Station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2065274", "label": "Hinchley Wood railway station", "description": "Hinchley Wood railway station: Hinchley Wood railway station is in the centre of the compact suburban village of Hinchley Wood in Surrey, England. It is 14 miles 4 chains (22.6 km) down the line from London Waterloo and opened in 1930 after the New Guildford Line first passed through the area in 1885.\nIt is the northernmost station on the line, following which the line merges into the four-track South West Main Line and is outside of the Transport for London area."}, {"id": "Q2526353", "label": "Surbiton railway station", "description": "Surbiton railway station: Surbiton railway station is a National Rail station in Surbiton, south-west London, in the Royal Borough of Kingston upon Thames. The station is managed and served by South Western Railway, and is in Travelcard Zone 6. It is 12 miles 3 chains (19.4 km) (12.04 miles) from London Waterloo. The front ticket office at Surbiton is open seven days a week.\nIt has been considered one of the finest modernist stations in Great Britain and is a Grade II listed building."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6455335", "label": "Kōyasan Station", "description": "Kōyasan Station: Kōyasan Station (高野山駅, Kōyasan-eki) is a passenger railway station in the town of  Kōya, Ito District, Wakayama Prefecture, Japan, operated by the private railway company Nankai Electric Railway."}, {"id": "Q5578128", "label": "Gokurakubashi Station", "description": "Gokurakubashi Station: Gokurakubashi Station (極楽橋駅, Gokurakubashi-eki) is a junction passenger railway station in located in the town of Kōya, Wakayama Prefecture, Japan, operated by the private railway company Nankai Electric Railway."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1078400", "label": "Shin-Kōenji Station", "description": "Shin-Kōenji Station: Shin-koenji Station (新高円寺駅, Shin-kōenji-eki) is a subway station on the Tokyo Metro Marunouchi Line in Suginami, Tokyo, Japan, operated by the Tokyo subway operator Tokyo Metro."}, {"id": "Q1078443", "label": "Higashi-Kōenji Station", "description": "Higashi-Kōenji Station: Higashi-koenji Station (東高円寺駅, Higashi-kōenji-eki) is a subway station on the Tokyo Metro Marunouchi Line in Suginami, Tokyo, Japan, operated by the Tokyo subway operator Tokyo Metro."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1777930", "label": "Kambo Station", "description": "Kambo Station: Kambo Station (Norwegian: Kambo stasjon) is located at the village of Kambo in Moss, Norway on the Østfold Line. The station is served by commuter trains L21 between Stabekk via Oslo to Moss with half hour or hourly headway by Vy."}, {"id": "Q1777982", "label": "Sonsveien Station", "description": "Sonsveien Station: Sonsveien holdeplass is a railway halt on the Østfold Line in south-eastern Norway near the village of Son in Vestby municipality. It is served by hourly commuter trains operated by Vy on line R21 between Moss and Oslo."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4348861", "label": "Räterschen railway station", "description": "Räterschen railway station: Räterschen is a railway station in the Swiss canton of Zurich and municipality of Elsau. The station is located on the St. Gallen–Winterthur line and is served by trains on the Zurich S-Bahn lines S12 and S35."}, {"id": "Q5847205", "label": "Schottikon railway station", "description": "Schottikon railway station: Schottikon railway station is a railway station in the Swiss canton of Zurich and municipality of Elsau. The station is located on the St. Gallen–Winterthur line and is served by trains on the Zurich S-Bahn lines S12 and S35."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2304475", "label": "South Ealing tube station", "description": "South Ealing tube station: South Ealing tube station is a London Underground station in the London Borough of Ealing. The station is on the Heathrow Airport branch of the Piccadilly line, between Acton Town and Northfields stations. It is located on South Ealing Road and is in Travelcard Zone 3."}, {"id": "Q344481", "label": "Acton Town tube station", "description": "Acton Town tube station: Acton Town is a London Underground station in the south-west corner of Acton, West London, in the London Borough of Ealing, close to the border with the London Borough of Hounslow. The station is served by the District and Piccadilly lines and is in Travelcard Zone 3. On the District line, it is between Chiswick Park and Ealing Common stations, and on the Piccadilly line it is between Hammersmith (Turnham Green in the early mornings and late evenings) and Ealing Common on the Uxbridge branch & South Ealing on the Heathrow branch.\nActon Town station was opened as Mill Hill Park on 1 July 1879 by the District Railway (DR, now the District line). It remained as a terminus until on 1 May 1883 and 23 June 1903 the DR opened two branches from Acton Town to Hounslow Town and Park Royal & Twyford Abbey respectively. On 4 July 1932 the Piccadilly line was extended to Acton Town. District line services to both the Hounslow and Uxbridge branches were withdrawn completely on 9 and 10 October 1964 after which operations were provided by the Piccadilly line alone.\nThe original brick-built station was built in 1879 and in February 1910 the station building was reconstructed. On 1 March 1910 the station was given its present name. In 1931 and 1932 the station was rebuilt again in preparation for transferring the Uxbridge branch service from the District line to the Piccadilly line. The new station was designed by Charles Holden in a modern European geometric style using brick, reinforced concrete and glass.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q15136731", "label": "Yenikapı railway station", "description": "Yenikapı railway station: Yenikapı was an indefinitely closed railway station on the İstanbul-Halkalı Line in the Yenikapı neighborhood of Istanbul, Turkey. The station was built in 1872 by the Oriental Railway which was then taken over by the Turkish State Railways in 1937 and electrified in 1955. The station is situated near the south end of the busy Gazi Mustafa Kemal Paşa Boulevard and one block north of Kennedy St, two major inner-city roadways and is 4.8 km (3.0 mi) west of Sirkeci Terminal. Due to the rehabilitation of the line between Halkalı and Kazlıçeşme for future Marmaray commuter service, Yenikapı was indefinitely closed on 19 March 2013. On 29 October 2013, the new underground Yenikapı railway station, which makes up a part of the new Yenikapı Transfer Center, was opened along with the trans-Bosphorus Marmaray tunnel. The new Yenikapı complex is located right next to the existing railway station and is serviced by 3 lines of the Istanbul Metro. The station was rebuilt and reopened on 26 February 2024 as part of the  T6 Sirkeci–Kazlıçeşme Tramway Line / U3 Sirkeci–Kazlıçeşme Rail Line.\n\n"}, {"id": "Q6424719", "label": "Kocamustafapaşa railway station", "description": "Kocamustafapaşa railway station: Kocamustafapaşa station is a railway station on the Sirkeci-Kazlıçeşme Line. The station is located in the Samatya neighborhood of Istanbul's Fatih district. Kocamustafapaşa was closed in 2013 due to the closure of the whole B1 line, after the opening of the new Marmaray line. The station was renovated and reopened as part of the T6 line that was inaugurated in February 2024."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q12311425", "label": "Firhøj station", "description": "Firhøj station: Firhøj station is a railway station serving the settlements of Firhøj and Munkerup near Gilleleje in North Zealand, Denmark.\nThe station is located on the Hornbæk Line from Helsingør to Gilleleje. The train services are currently operated by the railway company Lokaltog which runs frequent local train services between Helsingør station and Gilleleje station."}, {"id": "Q12308992", "label": "Dronningmølle station", "description": "Dronningmølle station: Dronningmølle station ((Danish pronunciation: [tʁʌne̝ŋˈmølə stæˈɕoˀn])) is a railway station serving the seaside resort town of Dronningmølle on the north coast of Zealand, Denmark.\nThe station is located on the Hornbæk Line from Helsingør to Gilleleje. The train services are currently operated by the railway company Lokaltog which runs frequent local train services between Helsingør station and Gilleleje station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q100834", "label": "Apgujeong Station", "description": "Apgujeong Station: Apgujeong (Korean pronunciation: [apk͈udʑʌŋ]) is a rapid transit station on Seoul Subway Line 3. It is located in Apgujeong-dong in the Gangnam-gu administrative district of Seoul.  It has a pair of underground side platforms. The station has connections to 15 buses through 6 exits. It services Sinsa-dong and Apgujeong-dong. The area is named after a pavilion frequented by Han Myung-hoi, whose pen-name was Apgujeong, and its sub-name comes from the nearby flagship Apgujeong Main store of Hyundai Department Store."}, {"id": "Q100839", "label": "Sinsa Station", "description": "Sinsa Station: Sinsa station is a station on the Seoul Subway Line 3 and the Shinbundang Line. It is located in Sinsa-dong, Gangnam-gu and Jamwon-dong, Seocho-gu, Seoul.  It will serve as the northern terminus of the Wirye–Sinsa Line when it is opened in 2025."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q962430", "label": "Montpelier railway station", "description": "Montpelier railway station: Montpelier railway station is on the Severn Beach Line and serves the district of Montpelier in Bristol, England. It is 2.85 miles (4.59 km) from Bristol Temple Meads. Its three letter station code is MTP. The station has a single platform, serving trains in both directions. As of 2015 it is managed by Great Western Railway, which is the third franchise to be responsible for the station since privatisation in 1997. They provide all train services at the station, mainly a train every 30 minutes in each direction.\n\nThe station was opened on 1 October 1874 as Montpellier (two 'L's) by the Great Western and Midland Railways as part of the Clifton Extension Railway, designed to connect the port of Avonmouth to the national rail network. In February 1888 the station's name changed to Montpelier (one 'L'). The station had two platforms, with the main structures on the southern platform and smaller waiting rooms on the northern platform. In 1903 the station employed 19 staff. Much of the main station building was destroyed by bombing during the Second World War.\nThe Severn Beach Line declined over the latter half of the twentieth century, with passenger numbers falling significantly. Goods services at Montpelier ended in 1965, and all staff were withdrawn in 1967. The line was largely reduced to single track in 1970, with the northern platform abandoned and all trains using the remaining platform. The station building is no longer in railway use. Services had decreased to ten per day each direction by 2005, but have since increased to a train every 30 minutes in each direction."}, {"id": "Q603576", "label": "Redland railway station", "description": "Redland railway station: Redland railway station is on the Severn Beach Line and serves the districts of Cotham and Redland in Bristol, England. It is 3.3 miles (5.3 km) from Bristol Temple Meads. Its three letter station code is RDA. As of 2015 it is managed by Great Western Railway, which is the third franchise to be responsible for the station since privatisation in 1997. They provide all train services at the station, mainly a train every 30 minutes in each direction.\n\nThe line through Redland was opened in 1874 by the Great Western and Midland Railways as part of the Clifton Extension Railway. The station itself was opened in 1897 following a petition by local residents. There were two platforms, with the main station building on the Bristol-bound platform and smaller facilities on the opposite platform. No goods facilities were provided. The main station building, although no longer in railway use, is the only original station building left on the line. In 1903 the station had 11 staff.\nThe Severn Beach Line declined over the latter half of the twentieth century, with passenger numbers falling significantly. All station staff were withdrawn in 1967, with the line through the station reduced to single track in 1970, with the second platform taken out of use. Services had decreased to ten per day each direction by 2005, but have since increased to a train every 30 minutes in each direction."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4411760", "label": "Kirkkonummi railway station", "description": "Kirkkonummi railway station: Kirkkonummi railway station (Finnish: Kirkkonummen rautatieasema, Swedish: Kyrkslätts järnvägsstation) is a railway station in the municipality of Kirkkonummi, Finland, between Siuntio railway station and Tolsa railway station.\nKirkkonummi railway station serves as the terminus for the U and most L trains of the Helsinki commuter rail system and is also served by Y, X and L trains to Siuntio. Most of the long-distance trains between Helsinki and Turku used to stop at Kirkkonummi station until 2016. Nowadays only some few long-distance services make a stop at Kirkkonummi. The station has also three VR bus departures to Karis via Ingå on weekdays."}, {"id": "Q4412000", "label": "Siuntio railway station", "description": "Siuntio railway station: Siuntio railway station (Finnish: Siuntion rautatieasema, Swedish: Sjundeå järnvägsstation) is a railway station in the municipality of Siuntio, Finland, between the stations of Kirkkonummi and Karis."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5846852", "label": "Otelfingen railway station", "description": "Otelfingen railway station: Otelfingen is a railway station in Switzerland. The station is situated in the municipality of Otelfingen. The station is located on the Furttal railway line between Wettingen and Zürich Oerlikon stations.Otelfingen is a stop of the Zurich S-Bahn served by trains on line S6, which operate twice-hourly to and from Zürich Hauptbahnhof, with a journey time of just under 30 minutes. The station is linked to the villages of Otelfingen and Boppelsen by Glattalbus bus route 450, which operates twice-hourly on Monday through Saturday.Otelfingen was the junction for the former Niederglatt-Otelfingen railway line, which once connected with Niederglatt station on the Bülach branch of the Bülach-Regensberg Railway but closed to through trains in 1937. A short stretch of the line has been retained as a siding, and joins the main line just to the east of the station."}, {"id": "Q5391049", "label": "Otelfingen Golfpark railway station", "description": "Otelfingen Golfpark railway station: Otelfingen Golfpark is a railway station in Switzerland. The station is situated in the municipality of Otelfingen. The station is located on the Furttal railway line and is a stop of the Zurich S-Bahn served by line S6."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q15964123", "label": "Egnach railway station", "description": "Egnach railway station: Egnach railway station (German: Bahnhof Egnach) is a railway station in Egnach, in the Swiss canton of Thurgau. It is located on the Lake line of Swiss Federal Railways. The station is approximately 800 metres (2,600 ft) from the Neukirch-Egnach station on the Bodensee–Toggenburg line."}, {"id": "Q508197", "label": "Romanshorn railway station", "description": "Romanshorn railway station: Romanshorn railway station (German: Bahnhof Romanshorn) is a railway station that serves the municipality of Romanshorn, in the canton of Thurgau, Switzerland.  Opened in 1855, the station is owned and operated by SBB-CFF-FFS.  It forms the junction between the Winterthur–Romanshorn railway, the Schaffhausen–Rorschach railway and the Romanshorn–Nesslau Neu St. Johann railway.\nThe SBB-CFF-FFS and THURBO operate both long-distance and local traffic to and from the station. These include four St. Gallen S-Bahn lines and an InterCity train to Brig."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2451415", "label": "Homerton railway station", "description": "Homerton railway station: Homerton is a station on the North London line in the district of Homerton, East London. The station and all trains serving it are operated by London Overground. It is in London fare zone 2. The current station opened on 13 May 1985 to coincide with the introduction of the Richmond to North Woolwich through electric passenger service. The station is close to Homerton University Hospital and Hackney Marshes."}, {"id": "Q2003534", "label": "Hackney Wick railway station", "description": "Hackney Wick railway station: Hackney Wick is a station on the North London Line in the area of Hackney Wick, East London. It is in Travelcard Zone 2. The station and all trains serving it are operated by London Overground. It opened on 12 May 1980 by British Rail as part of the Crosstown Linkline service between North Woolwich and Camden Road stations. Between Spring 2017 and May 2018 the station was rebuilt and modernised, including replacement of the footbridge by a subway.  The new subway, in addition to linking the two platforms will, later in 2018, provide a cycle and pedestrian link between Hackney and Tower Hamlets."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6417582", "label": "Kita-Noheji Station", "description": "Kita-Noheji Station: Kita-Noheji Station (北野辺地駅, Kita-Noheji-eki) is a railway station in the town of Noheji, Kamikita District, Aomori Prefecture, Japan, operated by  East Japan Railway Company (JR East)."}, {"id": "Q6393634", "label": "Noheji Station", "description": "Noheji Station: Noheji Station (野辺地駅, Noheji-eki) is a railway station located in the central district of the town of Noheji in Aomori Prefecture, Japan. The station has been operating since 1891.  Since 2010, the station has been jointly operated by the East Japan Railway Company (JR East) and the Aoimori Railway Company, a third sector, regional rail operator. The station is the southern terminus of JR East's Ōminato Line and was formerly the northern terminus of the Nanbu Jūkan Railway."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q8071199", "label": "Zhuangqiao railway station", "description": "Zhuangqiao railway station: Zhuangqiao railway station is a railway station on the Hangzhou–Ningbo high-speed railway located in Jiangbei District, Ningbo, Zhejiang, China."}, {"id": "Q1017158", "label": "Ningbo railway station", "description": "Ningbo railway station: Ningbo railway station (simplified Chinese: 宁波站; traditional Chinese: 寧波站; pinyin: Níngbō zhàn) is a railway station on the Xiaoshan–Ningbo railway, Ningbo–Taizhou–Wenzhou railway and Hangzhou–Ningbo high-speed railway located in Haishu District, Ningbo, Zhejiang, China."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4929227", "label": "Blue Hill Avenue station", "description": "Blue Hill Avenue station: Blue Hill Avenue station is a regional rail station on the MBTA Commuter Rail Fairmount Line located in the Mattapan neighborhood of Dochester, Boston, Massachusetts. The station consists of a center island platform between the line's two tracks, with handicapped-accessible ramps to Blue Hill Avenue and Cummins Highway. Originally intended to open along with Newmarket, Four Corners/Geneva, and Talbot Avenue, it was significantly delayed due to local controversy. Construction began in 2017, and the station opened on February 25, 2019."}, {"id": "Q6914948", "label": "Morton Street station", "description": "Morton Street station: Morton Street station is an MBTA Commuter Rail station on Fairmount Line located on Morton Street (MA 203) in the Mattapan neighborhood of Boston. With two full-length high-level platforms and ramps to the street, the station is fully wheelchair accessible. The station was reconstructed in 2006, with the official reopening in 2007."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7399863", "label": "Saichi Station", "description": "Saichi Station: Saichi Station (最知駅, Saichi-eki) was a JR East railway station located in Kesennuma, Miyagi Prefecture, Japan. It was destroyed by the 2011 Tōhoku earthquake and tsunami and services have now been replaced by a provisional bus rapid transit line."}, {"id": "Q7334130", "label": "Rikuzen-Hashikami Station", "description": "Rikuzen-Hashikami Station: Rikuzen-Hashikami Station (陸前階上駅, Rikuzen-Hashikami-eki) was a JR East railway station located in the city of Kesennuma, Miyagi Prefecture, Japan. The station was damaged by the 2011 Tōhoku earthquake and tsunami; however services have now been replaced by a provisional bus rapid transit line."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q3295440", "label": "Shawford railway station", "description": "Shawford railway station: Shawford railway station serves the villages of Twyford, Compton and Shawford in Hampshire, England. It is 69 miles 50 chains (112.1 km) down the line from London Waterloo.\nThis station and all trains serving it are operated by South Western Railway."}, {"id": "Q2285305", "label": "Eastleigh railway station", "description": "Eastleigh railway station: Eastleigh railway station serves the town of Eastleigh in the county of Hampshire in England. It is located on the South West Main Line and is the junction station for two other routes, the Eastleigh-Fareham Line and the Eastleigh-Romsey Line. It is 73 miles 35 chains (118.2 km) from London Waterloo. South of the station are Eastleigh Railway Works and Eastleigh Depot."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5613834", "label": "Lidui Park railway station", "description": "Lidui Park railway station: The Lidui Park railway station (Chinese: 离堆公园站; pinyin: Líduī Gōngyuán Zhàn) is an underground railway station. The former name is Guanxian Ancient Town railway station. The railway station is on the Lidui Branch Line of Chengdu–Dujiangyan Intercity Railway in Dujiangyan, Chengdu, Sichuan, China. This railway station is 12192 square metres."}, {"id": "Q14481122", "label": "Yingbin Road railway station", "description": "Yingbin Road railway station: The Yingbin Road railway station (Chinese: 迎宾路站; pinyin: Yíng Bīn Lù Zhàn) is an underground railway station. The railway station is on the Lidui Branch Line of Chengdu–Dujiangyan Intercity Railway in Chengdu, Sichuan, China."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1924477", "label": "Dalston Kingsland railway station", "description": "Dalston Kingsland railway station: Dalston Kingsland railway station is a railway station on the North London Line in London, England. It is in the Dalston area of the London Borough of Hackney, on the western side of Kingsland High Street and opposite Ridley Road Market. The station and all trains serving it are operated by London Overground. It is in Travelcard Zone 2. Kingsland railway station was first opened on the site in 1850, but was replaced by Dalston Junction in 1865. The current station was opened by British Rail in 1983. Ticket barriers are in operation. The station straddles the boundary with the London Borough of Islington, with part of the platforms falling within Islington."}, {"id": "Q800611", "label": "Canonbury railway station", "description": "Canonbury railway station: Canonbury railway station serves the districts of Canonbury and Highbury within the London Borough of Islington in north London. It is on London Overground's North London line and East London line. The station and all trains serving it are operated by London Overground, and the station is in Travelcard Zone 2. This location of the station is close to the boundary with the London Borough of Hackney."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q11598546", "label": "Kyōteijō-mae Station", "description": "Kyōteijō-mae Station: Kyōteijō-mae Station (競艇場前駅, Kyōteijōmae-eki) is a passenger railway station located in the city of Fuchū, Tokyo, Japan, operated by the private railway operator Seibu Railway."}, {"id": "Q11485783", "label": "Hiroden-ajina Station", "description": "Hiroden-ajina Station: Hiroden-ajina is a Hiroden station on Hiroden Miyajima Line, located in Ajina, Hatsukaichi, Hiroshima."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5097203", "label": "Canton Tower station", "description": "Canton Tower station: Canton Tower Station (simplified Chinese: 广州塔站; traditional Chinese: 廣州塔站; Cantonese Yale: Gwóngjāu Taap Jaahm) is an interchange station on Line 3 and Zhujiang New Town Automated People Mover Systems of the Guangzhou Metro. It started operations on 28 December 2005. It is an underground station located to the south of Binjiang Road East in Haizhu District, on the south bank of the Pearl River.\nThe station was previously called Chigang Pagoda Station (赤岗塔站), named after the nearby Chigang Pagoda which, despite being a relatively lesser-known architectural heritage in Guangzhou, was the only recognisable structure in the immediate vicinity when the station was constructed. However, after the station was opened, the Canton Tower, a new TV and sightseeing tower, was built directly above it. This iconic piece of architecture quickly became the city's new landmark, and the name of the station was often confused with Chigang station (赤岗站) of line 8, so it was changed to Canton Tower Station in December 2013 when line 6 was opened. It is the first station built for sightseeing purposes in the Guangzhou Metro system. The station is connected to an underground APM system which provides quick access to the Zhujiang New Town CBD across the river.The station is the terminus of the Haizhu Tram line of Guangzhou Trams, which runs to Wanshengwei Station."}, {"id": "Q6124351", "label": "Kecun station", "description": "Kecun station: Kecun Station (Chinese: 客村站; Cantonese Yale: Haakchyūn Jaahm) is an interchange station between Lines 3 and 8 of the Guangzhou Metro. It started operations on 28 June 2003. It is located at the underground of Kecun Village in Haizhu District.Before the extension to both lines 2 and 8 opened in September 2010, this station ran as part of Line 2 as a single line from Wanshengwei to Sanyuanli."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q688541", "label": "Karlsruhe Central Station", "description": "Karlsruhe Central Station: Karlsruhe Hauptbahnhof is a railway station in the German city of Karlsruhe. The station is classified as a Category 1 station, as it is a major hub where several railways connect."}, {"id": "Q706994", "label": "Mannheim Central Station", "description": "Mannheim Central Station: Mannheim Hauptbahnhof (German for Mannheim central station) is a railway station in Mannheim in the German state of Baden-Württemberg. It is the second largest traffic hub in southwestern Germany behind Stuttgart Hauptbahnhof, with 658 trains a day, including 238 long-distance trains. It is also a key station in the Rhine-Neckar S-Bahn. 100,000 passengers embark, disembark or transfer between trains at the station each day. The station was modernised in 2001. It is classified by Deutsche Bahn as a category 2 station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5969824", "label": "Wuxi railway station", "description": "Wuxi railway station: Wuxi railway station (simplified Chinese: 无锡站; traditional Chinese: 無錫站; pinyin: Wúxī zhàn) is a railway station of Jinghu railway and Shanghai-Nanjing Intercity Railway, located in Chong'an District, Wuxi, Jiangsu, is a special station under the jurisdiction of China Railway Shanghai Bureau Group Co., Ltd. The main lines are the Beijing-Shanghai Railway and the Shanghai-Nanjing Intercity Railway.\nWuxi Station was first built in 1905 and was originally a first-class station; in 1973, Wuxi Station began to expand; in 1976, Wuxi Station was built as a double-track station; in 1999, Wuxi Station became a special-class station; on December 10, 2018, Wuxi Station The reconstruction project of the South Square has been completed and put into use.\nAs of December 2018, the platform size of Wuxi Railway Station is 7 platforms and 12 lines.\nIn 2022, the renovation and construction of the underground passage, square and surrounding buildings in the south square of the station have been started."}, {"id": "Q5935214", "label": "Huishan railway station", "description": "Huishan railway station: Huishan railway station is a railway station of Shanghai–Nanjing Intercity Railway located in Huishan District, Wuxi, Jiangsu, People's Republic of China. In the future, the Yancheng–Yixing intercity railway will pass through this station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q3971116", "label": "Tipperary halt", "description": "Tipperary halt: Tipperary Station is a railway station that serves the town of Tipperary, County Tipperary in Ireland. It is approximately 500 metres from centre of town.\nIt has a weekday passenger service of two trains to Limerick Junction and two to Waterford. There is no Sunday service. Until 19 January  2013 (inclusive) there were three trains each way. However the late-morning Waterford to Limerick Junction and early-afternoon Limerick Junction to Waterford trains are now discontinued.Change at Limerick Junction for connections to Limerick, Cork, Tralee, Galway & Dublin.\nThe station is staffed, but the ticket office and platform are not wheelchair-accessible.In the 2017 NTA Heavy Rail Census, it showed the lowest usage figures of any station in the country, with a total of ten passengers, down from 24 in the 2016 census. This figure is for a given day, not an annual figure, and does not represent any weekend-specific commuting traffic or other seasonal variations."}, {"id": "Q2059829", "label": "Limerick Junction", "description": "Limerick Junction: Limerick Junction (Irish: Gabhal Luimnigh) is the interchange railway station for trains originating in Limerick, Dublin Heuston, Cork, Waterford, Tralee and Ennis stations. The station opened on 3 July 1848.\nThe station was highly noted for its layout which prior to 1967 required every train making a stop at the station to make a reversal to do so.  The latest changes in 2019, including the addition of a new island platform, mean only trains to and from the Waterford direction need to reverse before and after accessing the station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6964422", "label": "Nanukamachi Station", "description": "Nanukamachi Station: Nanukamachi Station (七日町駅, Nanukamachi-eki) is a railway station on the Tadami Line in the city of Aizuwakamatsu, Fukushima Prefecture, Japan, operated by East Japan Railway Company (JR East). Nanukamachi is \"七日町\" in Japanese. It means that bazaar was held on the seventh day in Edo era. \"七日町\" is also called \"Nanokamachi\"."}, {"id": "Q4699462", "label": "Aizu-Wakamatsu Station", "description": "Aizu-Wakamatsu Station: Aizu-Wakamatsu Station (会津若松駅, Aizu-wakamatsu-eki) is a railway station in the city of Aizuwakamatsu, in Fukushima Prefecture, Japan. It is the main station for Aizu-Wakamatsu and surrounding areas. The station also has a freight terminal operated by Japan Freight Railway Company (JR Freight)."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q615052", "label": "Gare de Saint-Cloud", "description": "Gare de Saint-Cloud: Saint-Cloud is a station in the commune of Saint-Cloud (department of Hauts-de-Seine). It is in the Île-de-France region of France and is part of the Transilien rail network."}, {"id": "Q2424785", "label": "Gare de Suresnes-Mont-Valérien", "description": "Gare de Suresnes-Mont-Valérien: Suresnes–Mont-Valérien is a French railway station on the line from Paris-Saint-Lazare to Versailles-Rive-Droite, located in the territory of the commune of Suresnes, in the Hauts-de-Seine department, in the Île-de-France region. It notably serves the Foch Hospital, located opposite.\nThe station opened in 1840, is today a station of the Société nationale des chemins de fer français (SNCF) served by the trains of line L of the Transilien (Paris-Saint-Lazare network) as well as those of line U (La Défense - La Verrière). It is located at a distance of 11.0 km from Paris-Saint-Lazare train station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q11061931", "label": "Guangbutun Station", "description": "Guangbutun Station: Guangbutun Station (Chinese: 广埠屯站), is a station of Line 2 of Wuhan Metro. It entered revenue service on December 28, 2012. It is located in Hongshan District."}, {"id": "Q15929494", "label": "Jiedaokou Station", "description": "Jiedaokou Station: Jiedaokou Station (Chinese: 街道口站), is a station of Line 2 and Line 8 of Wuhan Metro. It entered revenue service on December 28, 2012. It is located in Hongshan District."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q16895448", "label": "Mount Dennis", "description": "Mount Dennis: Mount Dennis is a neighbourhood in Toronto, Ontario, Canada. It was initially an urban area within the former township of York. Primarily located along Eglinton Avenue between the Humber River and the Kitchener commuter rail line, the neighbourhood was best known for Kodak Heights, once a major film manufacturing facility owned and operated by the Eastman Kodak Company. According to the 2016 Toronto Ward 11 Census, 62,620 residents are in the area, with a median age of 39.3 as of 2016, and a population growth of over 0.4% as of 2016. 24, 895 households are in Ward 11, and 230 net new households were built in 2016.  A total of 31,125 of 62,620 are immigrant populations as of 2016. Unemployment rate is 9.5% in Ward 11 as of 2016,  with an average household income of $66,447 and is much lower than Toronto's average of $102,721 as of 2016. Average rent price is $940/month as of 2016's census as well."}, {"id": "Q4928403", "label": "Bloor GO Station", "description": "Bloor GO Station: Bloor GO Station is a railway station on GO Transit's Kitchener line and Union Pearson Express rail services, located in Toronto, Ontario, on Bloor Street east of Dundas Street West. It is near Dundas West station on the TTC's Line 2 Bloor–Danforth but is not directly connected to it."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q24948215", "label": "Bhilai Nagar railway station", "description": "Bhilai Nagar railway station: Bhilai Nagar Railway Station is a small railway station of Bhilai city, Chhattisgarh. Its code is BQR. It serves Bhilai city. The station consists of five platforms. Bhilai Nagar one of the five railway station in Bhilai city. The station lies on the main Howrah–Mumbai rail line."}, {"id": "Q23074356", "label": "Bhilai Power House railway station", "description": "Bhilai Power House railway station: Bhilai Power House Railway Station is the second main railway station in Durg district in the Indian state of Chhattisgarh. Its code is BPHB. It serves the Bhilai urban areas. The station consists of three platforms. The Bhilai Power House is one of five in Bhilai city. It is well connected with other major cities. It has been rated grade A by Indian Railways.\nThis railway station is most important among other 2 railway station which provide railway connection for Bhilai. Its too nearest from Bhilai Steel Plant about 1 Kilometer south. ACC Jamul cement plant have in 2 Kilometer north of this railway station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q6124150", "label": "Shaoyaoju station", "description": "Shaoyaoju station: Shaoyaoju Station (simplified Chinese: 芍药居站; traditional Chinese: 芍藥居站; pinyin: Sháoyàojū Zhàn) is a station on Line 10 and Line 13 of the Beijing Subway."}, {"id": "Q5613705", "label": "Guangxi Men station", "description": "Guangxi Men station: Guangximen Station (simplified Chinese: 光熙门站; traditional Chinese: 光熙門站; pinyin: Guāngxīmén Zhàn) is a station on Line 13 of the Beijing Subway. It is located south of the interchange of North 3rd Ring Road East and the southern terminus of the Jingcheng Expressway, known as Taiyanggong Bridge (太阳宫桥)."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q4884852", "label": "Belvaux-Soleuvre railway station", "description": "Belvaux-Soleuvre railway station: Belvaux-Soleuvre railway station (Luxembourgish: Gare Bieles-Zolwer, French: Gare de Belvaux-Soleuvre, German: Bahnhof Beles-Zolver) is a railway station serving the towns of Belvaux and Soleuvre, in the commune of Sanem, in south-western Luxembourg.  The station is operated by Chemins de Fer Luxembourgeois, the state-owned railway company.\nThe station is situated on Line 60, which connects Luxembourg City to the Red Lands of the south of the country."}, {"id": "Q4884846", "label": "Belval-Rédange railway station", "description": "Belval-Rédange railway station: Belval-Rédange railway station (Luxembourgish: Gare Belval-Réideng, French: Gare de Belval-Rédange, German: Bahnhof Belval-Redingen) is a railway station serving the neighbourhood of Belval, in the west of Esch-sur-Alzette, in southern Luxembourg.  The 'Rédange' in the name is a reference to the French town of Rédange, which lies just across the border.  The station is operated by Chemins de Fer Luxembourgeois, the state-owned railway company.\nThe station is situated on Line 60, which connects Luxembourg City to the Red Lands of the south of the country.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2004430", "label": "Chirk railway station", "description": "Chirk railway station: Chirk railway station (Welsh: Y Waun) serves the town of Chirk, Wrexham County Borough, Wales. The station is on the Shrewsbury to Chester Line 21 miles (34 km) north of Shrewsbury, which is part of the former Great Western Railway mainline route from London Paddington to Birkenhead Woodside. The original 19th-century (grade 2 listed) Chirk / Y Waun station building was demolished in 1987, without consultation, by the local council.Chirk was also the eastern terminus and transfer point for the Glyn Valley Tramway."}, {"id": "Q2929352", "label": "Gobowen railway station", "description": "Gobowen railway station: Gobowen railway station is a railway station on the Shrewsbury to Chester Line of the former Great Western Railway's London Paddington to Birkenhead Woodside via Birmingham Snow Hill line, serving the village of Gobowen in Shropshire, England. It is the nearest station to the town of Oswestry."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1041600", "label": "Eglinton West station", "description": "Eglinton West station: Eglinton West is a subway station on Line 1 Yonge–University in Toronto, Ontario, Canada. It is located in the median of Allen Road on the north side of Eglinton Avenue West.\nLine 5 Eglinton will also serve Eglinton West station upon its completion, scheduled for 2024. At that time, Eglinton West will become an interchange station and be renamed Cedarvale. Metrolinx is building the line along Eglinton Avenue from Mount Dennis to Kennedy."}, {"id": "Q1041505", "label": "St. Clair West", "description": "St. Clair West: St. Clair West is a subway station on Line 1 Yonge–University in Toronto, Ontario, Canada. It spans the block north of St. Clair Avenue West to Heath Street, between Bathurst Street and Tweedsmuir Avenue. The station serves the local communities of Forest Hill South, Humewood, Bracondale Hill and Casa Loma.\nThe addition of automatic sliding doors, accessible fare gates, and elevators made the station fully accessible in 2017. Wi-Fi service is available at this station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1831712", "label": "London Road (Guildford) railway station", "description": "London Road (Guildford) railway station: London Road (Guildford) railway station is situated in the east of Guildford in Surrey, England, lying close to the suburbs of Merrow and Burpham. It is 28 miles 47 chains (46.0 km) down the line from London Waterloo.\nThe station is managed by South Western Railway, who also provide all train services.\nIt is situated on the New Guildford Line between Waterloo and Guildford via Cobham, although some trains operate via Epsom rather than Cobham.\nThe parenthesised Guildford is to avoid confusing the station with the similarly named London Road (Brighton).  The name was previously changed to \"London Road, Guildford\" from \"London Road\" in 1923 when operation of the line was taken over from the London and South Western Railway by the Southern Railway, which then ran all the railways in South East England."}, {"id": "Q604078", "label": "Guildford railway station", "description": "Guildford railway station: Guildford railway station is at one of three main railway junctions on the Portsmouth Direct Line and serves the town of Guildford in Surrey, England. It is 30 miles 27 chains (30.34 mi; 48.8 km) down the line from London Waterloo via Woking.It provides an interchange station for two other railway lines: the North Downs Line northwards towards Reading, which has a connection to Aldershot; the same line eastwards to Redhill; and the New Guildford Line, the alternative route to London Waterloo, via Cobham or Epsom.\nGuildford station is the larger, more frequently and more diversely served of the two stations in Guildford town centre, the other being London Road (Guildford) on the New Guildford Line."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7578950", "label": "Spondon railway station", "description": "Spondon railway station: Spondon railway station serves the Spondon area of Derby, England. The station is owned by Network Rail and managed by East Midlands Railway. It is 125 miles 67 chains (202.5 km) north of London St Pancras.\nSpondon is a penalty fare station if travelling with EMR. It is an unstaffed station equipped with a permit to travel machine."}, {"id": "Q3398679", "label": "Derby railway station", "description": "Derby railway station: Derby railway station ( , also known as Derby Midland) is a main line railway station serving the city of Derby in Derbyshire, England. Owned by Network Rail and managed by East Midlands Railway, the station is also served by CrossCountry services. It is the busiest station in Derbyshire, and the third busiest station in the East Midlands.It lies 127 miles 68 chains (205.8 km) north of London St Pancras. It is situated to the south-east of Derby city centre, and is close to the west bank of the River Derwent.\n\n"}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q5395859", "label": "Erskineville railway station", "description": "Erskineville railway station: Erskineville railway station is located on the Illawarra line, serving the Sydney suburb of Erskineville. It is served by Sydney Trains T3 Bankstown line services."}, {"id": "Q7595383", "label": "St Peters railway station", "description": "St Peters railway station: St Peters railway station is a heritage-listed railway station located on the Illawarra line, serving the Sydney suburb of St Peters in New South Wales, Australia. It is served by Sydney Trains T3 Bankstown line services. It was added to the New South Wales State Heritage Register on 2 April 1999."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q7689194", "label": "Tawa railway station", "description": "Tawa railway station: Tawa railway station, originally called Tawa Flat, is on the North Island Main Trunk Railway (NIMT) and is part of the suburban rail network of Wellington, New Zealand.  It is double tracked with an island platform, and is 13.75 kilometres (8.54 mi) from Wellington railway station, the southern terminus of the NIMT. The station serves the suburb of Tawa."}, {"id": "Q7306524", "label": "Redwood railway station", "description": "Redwood railway station: Redwood railway station on the suburban rail network of Wellington, New Zealand, is on the North Island Main Trunk Railway (NIMT). Opening in late 1963, it is double tracked with staggered side platforms; the up platform (north, towards Waikanae) is on the north side of the Tawa Street level crossing, the down platform (towards Wellington) on the south. The station serves the suburb of Redwood."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2071385", "label": "Hiiu railway station", "description": "Hiiu railway station: Hiiu railway station (Estonian: Hiiu raudteepeatus; previous name: Nõmme-Väike) is a railway station in the Nõmme district of Tallinn, Estonia. The station serves the Hiiu sub-district which has approximately 3900 residents. It is located approximately 9 kilometers (5,6 mi) southwest from the Baltic station (Estonian: Balti jaam) which is the main railway station of Tallinn, near the Baltic Sea. The Hiiu railway station is located between Nõmme and Kivimäe railway stations of Tallinn-Keila railway. The station was opened in 1926.\nThere are two platforms along the two-lane railway, both of which are 146 meters long. Elron's electric trains from Tallinn to Keila, Paldiski, Turba and Klooga-Rand stop at Hiiu station. The station belongs to the Zone I, within which traffic is free for Tallinners.\nThere is a possibility to transfer to TLT (Tallinn City Transport) bus lines 10, 27 at a nearby bus station on Pärnu maantee. Bus station for bus line 33 is located on Raudtee tänav and Hiiu tänav.\nIn 1929, a station building made of oil shale ash bricks and with a sloping roof was completed, where in 1932 the postal agency also moved. Ticket sales were terminated at the station building in the spring of 1998. In 1997, the building was declared an architectural monument.\n\nIn 2020, there were approximately 58 train departures per day at Hiiu railway station towards Tallinn city center."}, {"id": "Q1949527", "label": "Kivimäe railway station", "description": "Kivimäe railway station: Kivimäe railway station (Estonian: Kivimäe raudteepeatus) is a railway station in the Nõmme district  of Tallinn, Estonia. The station serves the Kivimäe sub-district which has approximately 4800 residents.\nIt is located approximately 10 kilometers (6,2 mi) southwest from the Baltic station (Estonian: Balti jaam) which is the main railway station of Tallinn, near the Baltic Sea. The Kivimäe railway station is located between Hiiu and Pääsküla railway stations of Tallinn-Keila railway. The station was opened on November 3, 1924.\nThere are two platforms along the two-track railway, 133 and 146 meters long. Elron's electric trains from Tallinn to Keila, Paldiski, Turba and Klooga-Rand stop at Kivimäe station. The station belongs to the Zone I, within which traffic is free for Tallinners.\nThere is a possibility to transfer to bus line 27 northwest of the railway station on Pärnu maantee.\nIn 1937 a station building was completed from silicate bricks according to the project of Hendrik Otlood, which in 1997 was declared a cultural monument.\nTicket sales in the station building ended in 1998.et:Kivimäe raudteepeatus\nIn 2020, there were approximately 58 train departures per day at Kivimäe railway station towards Tallinn city center."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1839037", "label": "Banavie railway station", "description": "Banavie railway station: Banavie railway station is a railway station on the West Highland Line serving the village of Banavie, although it is much closer to Caol, Scotland. It is sited between Corpach and Fort William, 0 miles 22 chains (0.44 km) from Banavie Junction, just north of Fort William. To continue on to the next station at Corpach, trains must pass over the Caledonian Canal at Neptune's Staircase, a popular tourist attraction. ScotRail provide all services at, and manage, the station."}, {"id": "Q2264654", "label": "Fort William railway station", "description": "Fort William railway station: Fort William railway station serves the town of Fort William, in the Highland region of Scotland. It is on the West Highland line, between Spean Bridge and Banavie, measured 99 miles 37 chains (160.1 km) from Craigendoran Junction, at the southern end of the line near Helensburgh. The station is managed by ScotRail, who operate most services from the station; Caledonian Sleeper and The Jacobite, an excursion operated by West Coast Railways, also use the station."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1136378", "label": "Kanazawa Station", "description": "Kanazawa Station: Kanazawa Station (金沢駅, Kanazawa-eki) is a major railway station in Kanazawa, Ishikawa, Japan, operated by West Japan Railway Company (JR West), the private railway operator Hokuriku Railroad, and the third-sector operator IR Ishikawa Railway.\nBeneath a square in front of the JR station is Hokutetsu-Kanazawa Station, the terminal of the Hokuriku Railroad Asanogawa Line."}, {"id": "Q5359940", "label": "Nishi-Kanazawa Station", "description": "Nishi-Kanazawa Station: Nishi-Kanazawa Station (西金沢駅, Nishi-Kanazawa-eki) is a railway station in the city of  Kanazawa, Ishikawa Prefecture, Japan."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q2751367", "label": "Sliedrecht Baanhoek railway station", "description": "Sliedrecht Baanhoek railway station: Sliedrecht Baanhoek is a railway station, in Sliedrecht, Netherlands."}, {"id": "Q2518670", "label": "Sliedrecht railway station", "description": "Sliedrecht railway station: Sliedrecht is a railway station in Sliedrecht, Netherlands. The station is located on the MerwedeLingelijn line between Dordrecht and Geldermalsen, part of the Betuwelijn."}], "in_extension": "1"}, {"predicate": {"id": "P197", "label": "adjacent station", "definition": "adjacent station: the stations next to this station, sharing the same line(s)."}, "arguments": [{"id": "Q1089392", "label": "Esplanade MRT station", "description": "Esplanade MRT station: Esplanade MRT station is an underground Mass Rapid Transit (MRT) station on the Circle Line (CCL) in Singapore. Situated in the Downtown Core, it is at the junction of Bras Basah Road, Raffles Boulevard and Nicoll Highway. As the name suggests, the station serves the Esplanade performing arts centre, alongside various developments such as War Memorial Park, Suntec City Mall and the Suntec Singapore Convention and Exhibition Centre. Esplanade station is linked to the nearby City Hall station via CityLink Mall, an underground retail development.\nFirst announced in 1999 as Convention Centre MRT station as part of the Marina MRT line, it was later incorporated into Stage 1 of the CCL. Several roads were diverted during its construction. The station was renamed Esplanade through a public poll in 2005. Along with the other stations on Stages 1 and 2 of the CCL, the station opened on 17 April 2010. Esplanade station features an Art-in-Transit artwork A Piece of Ice-Clear Heart by Lim Mu Hue."}, {"id": "Q1089363", "label": "Promenade MRT station", "description": "Promenade MRT station: Promenade MRT station is an underground Mass Rapid Transit (MRT) interchange station on the Downtown (DTL) and Circle (CCL) lines in Downtown Core, Singapore. Located underneath Temasek Avenue and adjacent to Millenia Tower, the station serves several key attractions and locations such as Suntec City and the Marina Promenade, which the station is named after. The station is at the junction of the Dhoby Ghaut and Marina Bay branches of the CCL.\nThe station was first announced as Milennia MRT station in 1999 and was part of the Marina Line, which later became CCL Stage 1. It was later announced in 2005 that the CCL would branch off from this station to serve Chinatown, which eventually became DTL Stage 1 in 2007. The station opened on 17 April 2010 as part of the CCL Stages 1 and 2. On 14 January 2012, the CCL branch to Marina Bay via Bayfront station opened. The DTL platforms opened on 22 December 2013 as part of Downtown line Stage 1. The DTL station is the second deepest station in the entire MRT network at 42 metres (138 ft), behind Bencoolen station at 43 metres (141 ft)."}], "in_extension": "1"}]